zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/drivers/fsl_power.c
/*
 * Copyright 2016,2020-2026 NXP
 * SPDX-License-Identifier: BSD-3-Clause
 */
#include "fsl_device_registers.h"
#include "fsl_common.h"
#include "fsl_power.h"
#include "fsl_iocon.h"
#include "fsl_system.h"
#include "fsl_rom_api.h"

/*! @name Driver version */
/*@{*/
/*! @brief MCXW23 power control version. */
#define FSL_MCXW23_POWER_CONTROL_VERSION (MAKE_VERSION(3, 0, 1))
/*@}*/

/* The settling time in microseconds of the BOD. After changing BOD level, POWER_IsBODActive is only valid after this
 * time */
#define STABILIZATION_TIME_IN_US (40)

/* FRO and XTAL startup time in milliseconds. */
#define DEFAULT_FRO_STARTUP_DELAY_MS  (100)
#define DEFAULT_XTAL_STARTUP_DELAY_MS (500)

/* Location in SRAM_X2 used to store CPU retention values. */
#define CPU_RETENTION_RAMX_STORAGE_START_ADDR (0x4002000)
#define CPU_RETENTION_RAMX_STORAGE_OFFSET (0x900)

/* BIAS configurations */
#define PMC_PDSLEEPCFG0_PDEN_BIAS_0_66     (0 << PMC_PDSLEEPCFG0_PDEN_BIAS_SHIFT)
#define PMC_PDSLEEPCFG0_PDEN_BIAS_0_63     (1u << PMC_PDSLEEPCFG0_PDEN_BIAS_SHIFT)
#define PMC_PDSLEEPCFG0_PDEN_BIAS_DISABLED (2u << PMC_PDSLEEPCFG0_PDEN_BIAS_SHIFT)
/* Configuration values to select desired power mode in PMC->CTRL  */
#define LOWPOWER_CTRL_LPMODE_ACTIVE        0
#define LOWPOWER_CTRL_LPMODE_DEEPSLEEP     1
#define LOWPOWER_CTRL_LPMODE_POWERDOWN     2
#define LOWPOWER_CTRL_LPMODE_DEEPPOWERDOWN 3
#define LOWPOWER_CTRL_POFFMODE_OFF 0
#define LOWPOWER_CTRL_POFFMODE_ON  1
#define LOWPOWER_CTRL_SELCLOCK_1MHZ 0 

/* excludeFromPd direct hardware bits mask */
#define EXCLUDE_FROM_PD_TO_SLEEPCFG0_MASK                                                                    \
    (kLOWPOWERCFG_DCDC | kLOWPOWERCFG_BOD1 | kLOWPOWERCFG_BOD2 | kLOWPOWERCFG_FRO1M | kLOWPOWERCFG_FRO192M | \
     kLOWPOWERCFG_FRO32K | kLOWPOWERCFG_XTAL32K | kLOWPOWERCFG_TRNG)

/*
 * Defines needed by functions GetCoreSysClkConfiguration(void) and
 * SetCoreSysClkConfiguration(uint32_t configuration)
 */

#define BIT_COUNT_1(x)     ((x) & 1U)
#define BIT_COUNT_2(x)     (BIT_COUNT_1(x) + BIT_COUNT_1((x) >> 1))
#define BIT_COUNT_4(x)     (BIT_COUNT_2(x) + BIT_COUNT_2((x) >> 2))
#define BIT_COUNT_8(x)     (BIT_COUNT_4(x) + BIT_COUNT_4((x) >> 4))
#define BIT_COUNT_16(x)    (BIT_COUNT_8(x) + BIT_COUNT_8((x) >> 8))
#define BIT_COUNT_32(x)    (BIT_COUNT_16(x) + BIT_COUNT_16((x) >> 16))
#define COUNT_BITS(mask)   BIT_COUNT_32(mask)

#define SYSCON_MAINCLKSELA_SEL_BITS               COUNT_BITS(SYSCON_MAINCLKSELA_SEL_MASK)
#define SYSCON_MAINCLKSELB_SEL_BITS               COUNT_BITS(SYSCON_MAINCLKSELB_SEL_MASK)
#define SYSCON_AHBCLKDIV_DIV_BITS                 COUNT_BITS(SYSCON_AHBCLKDIV_DIV_MASK)
#define ANACTRL_FRO192M_CTRL_ENA_BITS             COUNT_BITS(ANACTRL_FRO192M_CTRL_ENA_12MHZCLK_MASK | \
                                                             ANACTRL_FRO192M_CTRL_ENA_24MHZCLK_MASK | \
                                                             ANACTRL_FRO192M_CTRL_ENA_32MHZCLK_MASK | \
                                                             ANACTRL_FRO192M_CTRL_ENA_48MHZCLK_MASK | \
                                                             ANACTRL_FRO192M_CTRL_ENA_64MHZCLK_MASK)
#define SYSCON_CLOCK_CTRL_CLKIN_ENA_BITS          COUNT_BITS(SYSCON_CLOCK_CTRL_CLKIN_ENA_MASK)
#define SYSCON_CLOCK_CTRL_ANA_FRO12M_CLK_ENA_BITS COUNT_BITS(SYSCON_CLOCK_CTRL_ANA_FRO12M_CLK_ENA_MASK)
#define PMC_PDRUNCFG0_PDEN_FRO192M_BITS           COUNT_BITS(PMC_PDRUNCFG0_PDEN_FRO192M_MASK)

#define CONFIGURATION_SYSCON_MAINCLKSELA_SHIFT       (0)
#define CONFIGURATION_SYSCON_MAINCLKSELB_SHIFT       (CONFIGURATION_SYSCON_MAINCLKSELA_SHIFT + SYSCON_MAINCLKSELA_SEL_BITS)
#define CONFIGURATION_SYSCON_AHBCLKDIV_SHIFT         (CONFIGURATION_SYSCON_MAINCLKSELB_SHIFT + SYSCON_MAINCLKSELB_SEL_BITS)
#define CONFIGURATION_ANACTRL_FRO192M_CTRL_ENA_SHIFT (CONFIGURATION_SYSCON_AHBCLKDIV_SHIFT + SYSCON_AHBCLKDIV_DIV_BITS)
#define CONFIGURATION_SYSCON_CLOCK_CTRL_CLKIN_ENA_SHIFT \
    (CONFIGURATION_ANACTRL_FRO192M_CTRL_ENA_SHIFT + ANACTRL_FRO192M_CTRL_ENA_BITS)
#define CONFIGURATION_SYSCON_CLOCK_CTRL_ANA_FRO12M_CLK_ENA_SHIFT \
    (CONFIGURATION_SYSCON_CLOCK_CTRL_CLKIN_ENA_SHIFT + SYSCON_CLOCK_CTRL_CLKIN_ENA_BITS)
#define CONFIGURATION_PMC_PDRUNCFG0_PDEN_FRO192M_SHIFT \
    (CONFIGURATION_SYSCON_CLOCK_CTRL_ANA_FRO12M_CLK_ENA_SHIFT + SYSCON_CLOCK_CTRL_ANA_FRO12M_CLK_ENA_BITS)

/*
 * AOREG1 defines that match with bootloader
 */
#define AOREG1_DCDC_MODE_XR_SM_SS_SHIFT (24)
#define AOREG1_DCDC_MODE_XR_SM_SS_MASK  (1u << AOREG1_DCDC_MODE_XR_SM_SS_SHIFT)
#define AOREG1_DCDC_MODE_XR_SM_DS_SHIFT (25)
#define AOREG1_DCDC_MODE_XR_SM_DS_MASK  (1u << AOREG1_DCDC_MODE_XR_SM_DS_SHIFT)
#define AOREG1_BOD1_SHIFT (26)
#define AOREG1_BOD1_MASK  (1u << AOREG1_BOD1_SHIFT)
#define AOREG1_BOD2_SHIFT (27)
#define AOREG1_BOD2_MASK  (1u << AOREG1_BOD2_SHIFT)
/* BLE state related defines */
#define PMC_BLE_STATE                  ((PMC->STATUS & PMC_STATUS_FSMBLESTATE_MASK) >> PMC_STATUS_FSMBLESTATE_SHIFT)
#define PMC_BLE_STATE_RADIO_ACTIVE     (6u)
#define PMC_BLE_STATE_ENABLE_CLOCK_OUT (2u)

/* SRAM control related defines */
#define PMC_SRAMCTRL0_RAMX0_MASK                                                                    \
    (PMC_SRAMCTRL0_RAMX0_LS_MASK | PMC_SRAMCTRL0_RAMX0_DSB_MASK | PMC_SRAMCTRL0_RAMX0_DSBDEL_MASK | \
     PMC_SRAMCTRL0_RAMX0_LSDEL_MASK)
#define PMC_SRAMCTRL0_RAMX1_MASK                                                                    \
    (PMC_SRAMCTRL0_RAMX1_LS_MASK | PMC_SRAMCTRL0_RAMX1_DSB_MASK | PMC_SRAMCTRL0_RAMX1_DSBDEL_MASK | \
     PMC_SRAMCTRL0_RAMX1_LSDEL_MASK)
#define PMC_SRAMCTRL0_RAMX2_MASK                                                                    \
    (PMC_SRAMCTRL0_RAMX2_LS_MASK | PMC_SRAMCTRL0_RAMX2_DSB_MASK | PMC_SRAMCTRL0_RAMX2_DSBDEL_MASK | \
     PMC_SRAMCTRL0_RAMX2_LSDEL_MASK)
#define PMC_SRAMCTRL0_RAMX3_MASK                                                                    \
    (PMC_SRAMCTRL0_RAMX3_LS_MASK | PMC_SRAMCTRL0_RAMX3_DSB_MASK | PMC_SRAMCTRL0_RAMX3_DSBDEL_MASK | \
     PMC_SRAMCTRL0_RAMX3_LSDEL_MASK)
#define PMC_SRAMCTRL0_RAM00_MASK                                                                    \
    (PMC_SRAMCTRL0_RAM00_LS_MASK | PMC_SRAMCTRL0_RAM00_DSB_MASK | PMC_SRAMCTRL0_RAM00_DSBDEL_MASK | \
     PMC_SRAMCTRL0_RAM00_LSDEL_MASK)
#define PMC_SRAMCTRL0_RAM10_MASK                                                                    \
    (PMC_SRAMCTRL0_RAM10_LS_MASK | PMC_SRAMCTRL0_RAM10_DSB_MASK | PMC_SRAMCTRL0_RAM10_DSBDEL_MASK | \
     PMC_SRAMCTRL0_RAM10_LSDEL_MASK)
#define PMC_SRAMCTRL0_RAM20_MASK                                                                    \
    (PMC_SRAMCTRL0_RAM20_LS_MASK | PMC_SRAMCTRL0_RAM20_DSB_MASK | PMC_SRAMCTRL0_RAM20_DSBDEL_MASK | \
     PMC_SRAMCTRL0_RAM20_LSDEL_MASK)

#define PMC_SRAMCTRL1_RAMBLEDATA_MASK                                                                              \
    (PMC_SRAMCTRL1_RAMBLEDATA_LS_MASK | PMC_SRAMCTRL1_RAMBLEDATA_DSB_MASK | PMC_SRAMCTRL1_RAMBLEDATA_DSBDEL_MASK | \
     PMC_SRAMCTRL1_RAMBLEDATA_LSDEL_MASK)
#define PMC_SRAMCTRL1_RAMBLESEQL_MASK                                                                              \
    (PMC_SRAMCTRL1_RAMBLESEQL_LS_MASK | PMC_SRAMCTRL1_RAMBLESEQL_DSB_MASK | PMC_SRAMCTRL1_RAMBLESEQL_DSBDEL_MASK | \
     PMC_SRAMCTRL1_RAMBLESEQL_LSDEL_MASK)

#define PMC_SRAMCTRL0_NORMAL_MODE   (PMC_SRAMCTRL0_RAMX0_DSB_MASK | PMC_SRAMCTRL0_RAMX0_DSBDEL_MASK)
#define PMC_SRAMCTRL0_SHUTDOWN_MODE (PMC_SRAMCTRL0_RAMX0_LS_MASK | PMC_SRAMCTRL0_RAMX0_LSDEL_MASK)

/**
 * @brief Digital LDO voltage adjustment levels.
 */
typedef enum ldo_dig_vadj_s
{
    kLDO_DIG_900mv  = 0U,
    kLDO_DIG_950mv  = 1U,
    kLDO_DIG_1000mv = 2U,
    kLDO_DIG_1050mv = 3U,
} ldo_dig_vadj_t;

/**
 * @brief Memory LDO voltage adjustment levels.
 */
typedef enum ldo_mem_vadj_s
{
    kLDO_MEM_900mv  = 0U,
    kLDO_MEM_950mv  = 1U,
    kLDO_MEM_1000mv = 2U,
    kLDO_MEM_1050mv = 3U,
} ldo_mem_vadj_t;

/**
 * @brief Power supply modes.
 */
typedef enum supply_mode_s
{
    kSUPPLY_MODE_HV_SM       = 0U,
    kSUPPLY_MODE_XR_SS_BUCK  = 1U,
    kSUPPLY_MODE_XR_DS_BUCK  = 2U,
    kSUPPLY_MODE_COUNT       = 3U,
} supply_mode_t;

/**
 * @brief Low power modes.
 */
typedef enum lp_mode_s
{
    kLP_MODE_DEEPSLEEP     = 0U,
    kLP_MODE_POWERDOWN     = 1U,
    kLP_MODE_DEEPPOWERDOWN = 2U,
    kLP_MODE_POWEROFF      = 3U,
    kLP_MODE_COUNT         = 4U,
} lp_mode_t;

/**
 * @brief DC/DC exclusion modes.
 */
typedef enum DCDC_exclude_mode_s
{
    kDCDC_EXCLUDE_NONE   = 0U,
    kDCDC_EXCLUDE_DCDC   = 1U,
    kDCDC_EXCLUDE_BYPASS = 2U,
    kDCDC_EXCLUDE_COUNT  = 3U,
} dcdc_exclude_mode_t;

/**
 * @brief DC/DC hardware modes.
 * 
 * These must match the values in dcdc_mode_t.
 */
typedef enum dcdc_hw_mode_s
{
    kDCDC_HW_MODE_HV_SM = 1U,
    kDCDC_HW_MODE_LV_SM = 2U,
} dcdc_hw_mode_t;

typedef status_t(*DcdcExcludeFunction_t)(uint32_t *excludeFromPd);

static void DelayUs(uint32_t delay);
static status_t DcdcBypass(uint32_t *excludeFromPd);
static status_t DcdcOn(uint32_t *excludeFromPd);
static status_t DcdcOff(uint32_t *excludeFromPd);
static status_t DcdcError(uint32_t *excludeFromPd);

