zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/drivers/fsl_power.c
/*******************************************************************************
 * Global variables
 ******************************************************************************/
static uint32_t s_xtalStartupTimeMs = DEFAULT_XTAL_STARTUP_DELAY_MS;

/* Lookup table for MCXW23xB (Buck and XRSM) silicon */
static const DcdcExcludeFunction_t
    s_dcdcExcludeFunctionMcxw23xb[kLP_MODE_COUNT][kSUPPLY_MODE_COUNT][kDCDC_EXCLUDE_COUNT] = {
        {
            /* DEEPSLEEP */
            {DcdcBypass, DcdcOn, DcdcBypass},    /* kSUPPLY_MODE_HV_SM */
            {DcdcOff, DcdcError, DcdcError},     /* kSUPPLY_MODE_XR_SS_BUCK */
            {DcdcOff, DcdcError, DcdcError},     /* kSUPPLY_MODE_XR_DS_BUCK */
        },
        {
            /* POWERDOWN */
            {DcdcBypass, DcdcOn, DcdcBypass},    /* kSUPPLY_MODE_HV_SM */
            {DcdcOff, DcdcError, DcdcError},     /* kSUPPLY_MODE_XR_SS_BUCK */
            {DcdcOff, DcdcError, DcdcError},     /* kSUPPLY_MODE_XR_DS_BUCK */
        },
        {
            /* DEEPPOWERDOWN */
            {DcdcOff, DcdcOn, DcdcBypass},       /* kSUPPLY_MODE_HV_SM */
            {DcdcOff, DcdcError, DcdcError},     /* kSUPPLY_MODE_XR_SS_BUCK */
            {DcdcOff, DcdcError, DcdcError},     /* kSUPPLY_MODE_XR_DS_BUCK */
        },
        {
            /* POWEROFF */
            {DcdcOff, DcdcError, DcdcError},     /* kSUPPLY_MODE_HV_SM */
            {DcdcOff, DcdcError, DcdcError},     /* kSUPPLY_MODE_XR_SS_BUCK */
            {DcdcOff, DcdcError, DcdcError},     /* kSUPPLY_MODE_XR_DS_BUCK */
        },
    };

/* Lookup table for MCXW23xA (Boost) silicon */
static const DcdcExcludeFunction_t
    s_dcdcExcludeFunctionMcxw23xa[kLP_MODE_COUNT][kDCDC_EXCLUDE_COUNT] = {
        /* DEEPSLEEP */
        {DcdcOff, DcdcOn, DcdcBypass},
        /* POWERDOWN */
        {DcdcOff, DcdcOn, DcdcBypass},
        /* DEEPPOWERDOWN */
        {DcdcOff, DcdcOn, DcdcBypass},
        /* POWEROFF */
        {DcdcOff, DcdcError, DcdcError},
    };

/*******************************************************************************
 * Static functions
 ******************************************************************************/

 /**
 * @brief Save GPIO pin configuration registers to retention RAM
 */
 static void SavePinRegisters(void)
{
    uint32_t *cpuRetStorePtr =
        (uint32_t *)(CPU_RETENTION_RAMX_STORAGE_START_ADDR + CPU_RETENTION_RAMX_STORAGE_OFFSET);
    uint32_t pinsDir = GPIO->DIR[0];

    *cpuRetStorePtr++ = pinsDir;
    *cpuRetStorePtr++ = GPIO->PIN[0];
    for (uint32_t i = 0; i <= 22; i++)
    {
        *cpuRetStorePtr++ = IOCON->PIO[0][i];
        /* Set all pins that are configured as output, temporary to FUNC12 before going to lower power
        to avoid a 120ns pulse during wakeup from power down. */
        if ((pinsDir & (1u << i)) != 0u)
        {
            IOCON->PIO[0][i] = (IOCON->PIO[0][i] & ~IOCON_PIO_FUNC_MASK) | (IOCON_FUNC12 & IOCON_PIO_FUNC_MASK);
        }
    }
}

/**
 * @brief Restore GPIO pin configuration registers from retention RAM
 */
static void RestorePinRegisters(void)
{
    uint32_t *cpuRetStorePtr = (uint32_t *)(CPU_RETENTION_RAMX_STORAGE_START_ADDR + CPU_RETENTION_RAMX_STORAGE_OFFSET);
    GPIO->DIR[0]                = *cpuRetStorePtr++;
    GPIO->PIN[0]                = *cpuRetStorePtr++;
    for (uint32_t i = 0; i <= 22; i++)
    {
        IOCON->PIO[0][i] = *cpuRetStorePtr++;
    }
}

/**
 * @brief Get current core system clock configuration
 * @return Packed 32-bit value containing clock configuration
 */
static uint32_t GetCoreSysClkConfiguration(void)
{
    uint32_t returnValue = 0;
    uint32_t pos          = 0;
    returnValue |= (((SYSCON->MAINCLKSELA & SYSCON_MAINCLKSELA_SEL_MASK) >> SYSCON_MAINCLKSELA_SEL_SHIFT) << pos);
    pos += SYSCON_MAINCLKSELA_SEL_BITS;
    returnValue |= (((SYSCON->MAINCLKSELB & SYSCON_MAINCLKSELB_SEL_MASK) >> SYSCON_MAINCLKSELB_SEL_SHIFT) << pos);
    pos += SYSCON_MAINCLKSELB_SEL_BITS;
    returnValue |= (((SYSCON->AHBCLKDIV & SYSCON_AHBCLKDIV_DIV_MASK) >> SYSCON_AHBCLKDIV_DIV_SHIFT) << pos);
    pos += SYSCON_AHBCLKDIV_DIV_BITS;
    returnValue |=
        (((ANACTRL->FRO192M_CTRL & (ANACTRL_FRO192M_CTRL_ENA_12MHZCLK_MASK | ANACTRL_FRO192M_CTRL_ENA_24MHZCLK_MASK |
                                    ANACTRL_FRO192M_CTRL_ENA_32MHZCLK_MASK | ANACTRL_FRO192M_CTRL_ENA_48MHZCLK_MASK |
                                    ANACTRL_FRO192M_CTRL_ENA_64MHZCLK_MASK)) >>
          ANACTRL_FRO192M_CTRL_ENA_12MHZCLK_SHIFT)
         << pos);
    pos += ANACTRL_FRO192M_CTRL_ENA_BITS;
    returnValue |=
        (((SYSCON->CLOCK_CTRL & SYSCON_CLOCK_CTRL_CLKIN_ENA_MASK) >> SYSCON_CLOCK_CTRL_CLKIN_ENA_SHIFT) << pos);
    pos += SYSCON_CLOCK_CTRL_CLKIN_ENA_BITS;
    returnValue |= (((SYSCON->CLOCK_CTRL & SYSCON_CLOCK_CTRL_ANA_FRO12M_CLK_ENA_MASK) >>
                      SYSCON_CLOCK_CTRL_ANA_FRO12M_CLK_ENA_SHIFT)
                     << pos);
    pos += SYSCON_CLOCK_CTRL_ANA_FRO12M_CLK_ENA_BITS;
    returnValue |= (((PMC->PDRUNCFG0 & PMC_PDRUNCFG0_PDEN_FRO192M_MASK) >> PMC_PDRUNCFG0_PDEN_FRO192M_SHIFT) << pos);
    return returnValue;
}

/**
 * @brief Set core system clock configuration
 * @param configuration Packed 32-bit value containing clock configuration
 */
static void SetCoreSysClkConfiguration(uint32_t configuration)
{
    PMC->PDRUNCFG0 = (PMC->PDRUNCFG0 & ~PMC_PDRUNCFG0_PDEN_FRO192M_MASK) |
                     ((configuration >> CONFIGURATION_PMC_PDRUNCFG0_PDEN_FRO192M_SHIFT) &
                      ((1u << PMC_PDRUNCFG0_PDEN_FRO192M_BITS) - 1))
                         << PMC_PDRUNCFG0_PDEN_FRO192M_SHIFT;

    SYSCON->CLOCK_CTRL = (SYSCON->CLOCK_CTRL & ~SYSCON_CLOCK_CTRL_ANA_FRO12M_CLK_ENA_MASK) |
                         ((configuration >> CONFIGURATION_SYSCON_CLOCK_CTRL_ANA_FRO12M_CLK_ENA_SHIFT) &
                          ((1u << SYSCON_CLOCK_CTRL_ANA_FRO12M_CLK_ENA_BITS) - 1))
                             << SYSCON_CLOCK_CTRL_ANA_FRO12M_CLK_ENA_SHIFT;

    SYSCON->CLOCK_CTRL = (SYSCON->CLOCK_CTRL & ~SYSCON_CLOCK_CTRL_CLKIN_ENA_MASK) |
                         ((configuration >> CONFIGURATION_SYSCON_CLOCK_CTRL_CLKIN_ENA_SHIFT) &
                          ((1u << SYSCON_CLOCK_CTRL_CLKIN_ENA_BITS) - 1))
                             << SYSCON_CLOCK_CTRL_CLKIN_ENA_SHIFT;

    ANACTRL->FRO192M_CTRL =
        ((configuration >> CONFIGURATION_ANACTRL_FRO192M_CTRL_ENA_SHIFT) & ((1u << ANACTRL_FRO192M_CTRL_ENA_BITS) - 1))
        << ANACTRL_FRO192M_CTRL_ENA_12MHZCLK_SHIFT;
    SYSCON->AHBCLKDIV   = (configuration >> CONFIGURATION_SYSCON_AHBCLKDIV_SHIFT) & SYSCON_AHBCLKDIV_DIV_MASK;
    SYSCON->MAINCLKSELB = (configuration >> CONFIGURATION_SYSCON_MAINCLKSELB_SHIFT) & SYSCON_MAINCLKSELB_SEL_MASK;
    SYSCON->MAINCLKSELA = configuration & SYSCON_MAINCLKSELA_SEL_MASK;
}

/**
 * @brief Enable DCDC bypass mode
 * @param excludeFromPd Pointer to power down exclusion bitmap
 * @return Status of operation
 */
static status_t DcdcBypass(uint32_t *excludeFromPd)
{
    /* Set enable LPBS request */
    PMC->DCDC0 |= PMC_DCDC0_ENABLE_BYPASS_MASK;
    /* Disable DCDC during low power mode */
    *excludeFromPd &= ~(uint32_t)kLOWPOWERCFG_DCDC;
    return kStatus_Success;
}

/**
 * @brief Enable DCDC converter
 * @param excludeFromPd Pointer to power down exclusion bitmap
 * @return Status of operation
 */
static status_t DcdcOn(uint32_t *excludeFromPd)
{
    /* Disable LPBS */
    PMC->DCDC0 &= ~PMC_DCDC0_ENABLE_BYPASS_MASK;
    /* Enable DCDC during low power mode */
    *excludeFromPd |= kLOWPOWERCFG_DCDC;
    return kStatus_Success;
}

static status_t DcdcOff(uint32_t *excludeFromPd)
{
    /* Disable LPBS */
    PMC->DCDC0 &= ~PMC_DCDC0_ENABLE_BYPASS_MASK;
    /* Disable DCDC during low power mode */
    *excludeFromPd &= ~(uint32_t)kLOWPOWERCFG_DCDC;
    return kStatus_Success;
}

/**
 * @brief Disable DCDC converter
 * @param excludeFromPd Pointer to power down exclusion bitmap
 * @return Status of operation
 */
static status_t DcdcError(uint32_t *excludeFromPd)
{
    return kStatus_InvalidArgument;
}

/**
 * @brief Set power configuration for low power modes
 * @param lpMode Low power mode to configure
 * @param excludeFromPd Pointer to power down exclusion bitmap
 * @return Status of operation
 */
static status_t SetPowerConfiguration(lp_mode_t lpMode, uint32_t *excludeFromPd)
{
    dcdc_mode_t mode       = POWER_DCDC_GetSupplyMode();
    status_t status = kStatus_Success;

    dcdc_exclude_mode_t dcdcExclude = kDCDC_EXCLUDE_NONE;
    if ((*excludeFromPd & kLOWPOWERCFG_DCDC_BYPASS) && (*excludeFromPd & kLOWPOWERCFG_DCDC))
    {
        /* kLOWPOWERCFG_DCDC_BYPASS and kLOWPOWERCFG_DCDC cannot be added to excludeFromPd together. */
        status = kStatus_InvalidArgument;
    }
    else if(*excludeFromPd & kLOWPOWERCFG_DCDC_BYPASS)
    {
        dcdcExclude |= kDCDC_EXCLUDE_BYPASS;
    }
    else if(*excludeFromPd & kLOWPOWERCFG_DCDC)
    {
        dcdcExclude |= kDCDC_EXCLUDE_DCDC;
    }

