zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/drivers/fsl_power.c
    if(status == kStatus_Success)
    {
        /********************************* BUCK MODE (MCXW23xB) *********************************/
        if (mode == kDCDC_MODE_HV_SM)
        {
            status = s_dcdcExcludeFunctionMcxw23xb[lpMode][kSUPPLY_MODE_HV_SM][dcdcExclude](
                excludeFromPd);
        }
        /********************************* XRSM SS MODE (MCXW23xB) *********************************/
        else if (mode == kDCDC_MODE_XR_SM_SS)
        {
            /* XRSM only supported on MCXW23xB, so hw_mode is always buck */
            status = s_dcdcExcludeFunctionMcxw23xb[lpMode][kSUPPLY_MODE_XR_SS_BUCK][dcdcExclude](
                excludeFromPd);
        }
        /********************************* XRSM DS MODE (MCXW23xB) *********************************/
        else if (mode == kDCDC_MODE_XR_SM_DS)
        {
            /* XRSM only supported on MCXW23xB, so hw_mode is always buck */
            status = s_dcdcExcludeFunctionMcxw23xb[lpMode][kSUPPLY_MODE_XR_DS_BUCK][dcdcExclude](
                excludeFromPd);
        }
        /********************************* BOOST MODE (MCXW23xA) *********************************/
        else if (mode == kDCDC_MODE_LV_SM)
        {
            status = s_dcdcExcludeFunctionMcxw23xa[lpMode][dcdcExclude](
                excludeFromPd);
        }
        else
        {
            status = kStatus_InvalidArgument;
        }
    }

    return status;
}

/**
 * @brief Enable BOD1 interrupts
 */
static void EnableBOD1Interrupts(void)
{
    uint32_t intCtrl = ANACTRL->BOD_DCDC_INT_CTRL;
    intCtrl |= ANACTRL_BOD_DCDC_INT_CTRL_BOD1_INT_ENABLE_MASK;
    ANACTRL->BOD_DCDC_INT_CTRL = intCtrl;
}

/**
 * @brief Disable BOD1 interrupts
 */
static void DisableBOD1Interrupts(void)
{
    uint32_t intCtrl = ANACTRL->BOD_DCDC_INT_CTRL;
    intCtrl &= ~ANACTRL_BOD_DCDC_INT_CTRL_BOD1_INT_ENABLE_MASK;
    ANACTRL->BOD_DCDC_INT_CTRL = intCtrl;
}

/**
 * @brief Enable BOD1 reset functionality
 */
static void EnableBOD1Resets(void)
{
    uint32_t resetCtrl = PMC->RESETCTRL;
    resetCtrl &= (~(PMC_RESETCTRL_BOD1RESETENA_SECURE_MASK | PMC_RESETCTRL_BOD1RESETENA_SECURE_DP_MASK));
    resetCtrl |= (1 << PMC_RESETCTRL_BOD1RESETENA_SECURE_SHIFT | 1 << PMC_RESETCTRL_BOD1RESETENA_SECURE_DP_SHIFT);
    PMC->RESETCTRL = resetCtrl;
}

/**
 * @brief Disable BOD1 reset functionality
 */
static void DisableBOD1Resets(void)
{
    uint32_t resetCtrl = PMC->RESETCTRL;
    resetCtrl &= (~(PMC_RESETCTRL_BOD1RESETENA_SECURE_MASK | PMC_RESETCTRL_BOD1RESETENA_SECURE_DP_MASK));
    resetCtrl |= (2u << PMC_RESETCTRL_BOD1RESETENA_SECURE_SHIFT | 2u << PMC_RESETCTRL_BOD1RESETENA_SECURE_DP_SHIFT);
    PMC->RESETCTRL = resetCtrl;
}

/**
 * @brief Enable BOD2 interrupts
 */
static void EnableBOD2Interrupts(void)
{
    uint32_t intCtrl = ANACTRL->BOD_DCDC_INT_CTRL;
    intCtrl |= ANACTRL_BOD_DCDC_INT_CTRL_BOD2_INT_ENABLE_MASK;
    ANACTRL->BOD_DCDC_INT_CTRL = intCtrl;
}

/**
 * @brief Disable BOD2 interrupts
 */
static void DisableBOD2Interrupts(void)
{
    uint32_t intCtrl = ANACTRL->BOD_DCDC_INT_CTRL;
    intCtrl &= ~ANACTRL_BOD_DCDC_INT_CTRL_BOD2_INT_ENABLE_MASK;
    ANACTRL->BOD_DCDC_INT_CTRL = intCtrl;
}

/**
 * @brief Enable BOD2 reset functionality
 */
static void EnableBOD2Resets(void)
{
    uint32_t resetCtrl = PMC->RESETCTRL;
    resetCtrl &= (~(PMC_RESETCTRL_BOD2RESETENA_SECURE_MASK | PMC_RESETCTRL_BOD2RESETENA_SECURE_DP_MASK));
    resetCtrl |= (1 << PMC_RESETCTRL_BOD2RESETENA_SECURE_SHIFT | 1 << PMC_RESETCTRL_BOD2RESETENA_SECURE_DP_SHIFT);
    PMC->RESETCTRL = resetCtrl;
}

/**
 * @brief Disable BOD2 reset functionality
 */
static void DisableBOD2Resets(void)
{
    uint32_t resetCtrl = PMC->RESETCTRL;
    resetCtrl &= (~(PMC_RESETCTRL_BOD2RESETENA_SECURE_MASK | PMC_RESETCTRL_BOD2RESETENA_SECURE_DP_MASK));
    resetCtrl |= (2u << PMC_RESETCTRL_BOD2RESETENA_SECURE_SHIFT | 2u << PMC_RESETCTRL_BOD2RESETENA_SECURE_DP_SHIFT);
    PMC->RESETCTRL = resetCtrl;
}

/**
 * @brief Calculate adjusted BOD level register setting
 * @param level BOD level configuration
 * @param offset Calibration offset
 * @return Adjusted register value
 */
static uint32_t AdjustedLevelRegisterSetting(bod_level_t level, uint8_t offset)
{
    int8_t signedOffset = (int8_t)(offset & 0x1Fu);
    int8_t adjustedHysteresis;
    uint8_t adjustedTriglvl = ((level & PMC_BOD1_TRIGLVL_MASK) >> PMC_BOD1_TRIGLVL_SHIFT);
    uint8_t adjustedLvlsel  = ((level & PMC_BOD1_LVLSEL_MASK) >> PMC_BOD1_LVLSEL_SHIFT);

    /* Offset is 5 bits 2-complement encoded */
    if (offset & 0x10)
    {
        signedOffset -= 0x20;
    }

    /* Level contains the register value to be set in the BODx register. We calculate the adjustedHysteresis
     * from the hysteresis setting, the lvlsel setting and the offset. We extend the definition beyond 0 - 3 with
     * -5 for -100mV, -4 for -75mV, -3 for -50mV, -2 for -25mV, -1 for 0mV, 5 for +125mV, 6 for +150mV and 7 for +175mV.
     */
    if (adjustedLvlsel == 1)
    {
        adjustedHysteresis = -1;
    }
    else
    {
        adjustedHysteresis = ((level & PMC_BOD1_HYST_MASK) >> PMC_BOD1_HYST_SHIFT);
    }
    adjustedHysteresis -= signedOffset;

    if (adjustedTriglvl > 10) /* triglvl has steps of 100mV for setting 10 and above */
    {
        if (adjustedHysteresis < -1)
        {
            adjustedHysteresis += 4;
            adjustedTriglvl -= 1;
        }
        if (adjustedHysteresis > 3)
        {
            adjustedHysteresis -= 4;
            adjustedTriglvl += 1;
        }
    }
    else
    {
        if (adjustedTriglvl == 10) /* triglvl has steps for setting 10 of 100mV upwards and 50mV downwards */
        {
            if (adjustedHysteresis < -3)
            {
                adjustedHysteresis += 2;
                adjustedTriglvl -= 1;
            }
            if (adjustedHysteresis < -1)
            {
                adjustedHysteresis += 2;
                adjustedTriglvl -= 1;
            }
            if (adjustedHysteresis > 3)
            {
                adjustedHysteresis -= 4;
                adjustedTriglvl += 1;
            }
        }
        else /* triglvl has steps of 50mV for setting 9 and below */
        {
            if (adjustedHysteresis < -3)
            {
                adjustedHysteresis += 2;
                adjustedTriglvl -= 1;
            }
            if (adjustedHysteresis < -1)
            {
                adjustedHysteresis += 2;
                adjustedTriglvl -= 1;
            }
            if (adjustedHysteresis > 5)
            {
                adjustedHysteresis -= 2;
                adjustedTriglvl += 1;
            }
            if (adjustedHysteresis > 3)
            {
                adjustedHysteresis -= 2;
                adjustedTriglvl += 1;
            }
        }
    }

    /* To add 0mV we have to set adjustedLvlsel to 1, otherwise it must be set to 0. */
    if (adjustedHysteresis == -1)
    {
        adjustedHysteresis = 0;
        adjustedLvlsel     = 1;
    }
    else
    {
        adjustedLvlsel = 0;
    }
    return (uint32_t)(((uint32_t)adjustedLvlsel << PMC_BOD1_LVLSEL_SHIFT) |
                      ((uint32_t)((uint8_t)adjustedHysteresis) << PMC_BOD1_HYST_SHIFT) |
                      ((uint32_t)adjustedTriglvl << PMC_BOD1_TRIGLVL_SHIFT));
}

/**
 * Measure the voltage on Vbat_hv using the given BOD instance.
 *
 * Normal operation of the selected BOD is suspended during the conversion.
 * Voltage must remain stable during conversion in order to get accurate results
 * Note that WDT_BOD_IRQn is disabled during the measurement but is restored afterwards.
 *
 * @param instance 0 for BOD1 and 1 for BOD2.
 * @param voltage pointer to variable that'll hold the measured voltage in millivolts
 * @return kStatus_Success in case of success.
 */
static status_t MeasureVoltage(uint32_t instance, uint32_t *voltage)
{
    static const uint16_t levelSettings[] = {
        kBOD_LEVEL_1100mv, kBOD_LEVEL_1125mv, kBOD_LEVEL_1150mv, kBOD_LEVEL_1175mv, kBOD_LEVEL_1200mv,
        kBOD_LEVEL_1225mv, kBOD_LEVEL_1250mv, kBOD_LEVEL_1275mv, kBOD_LEVEL_1300mv, kBOD_LEVEL_1325mv,
        kBOD_LEVEL_1350mv, kBOD_LEVEL_1375mv, kBOD_LEVEL_1400mv, kBOD_LEVEL_1425mv, kBOD_LEVEL_1450mv,
        kBOD_LEVEL_1475mv, kBOD_LEVEL_1500mv, kBOD_LEVEL_1525mv, kBOD_LEVEL_1550mv, kBOD_LEVEL_1575mv,
        kBOD_LEVEL_1600mv, kBOD_LEVEL_1625mv, kBOD_LEVEL_1650mv, kBOD_LEVEL_1675mv, kBOD_LEVEL_1700mv,
        kBOD_LEVEL_1725mv, kBOD_LEVEL_1750mv, kBOD_LEVEL_1775mv, kBOD_LEVEL_1800mv, kBOD_LEVEL_1825mv,
        kBOD_LEVEL_1850mv, kBOD_LEVEL_1875mv, kBOD_LEVEL_1900mv, kBOD_LEVEL_1925mv, kBOD_LEVEL_1950mv,
        kBOD_LEVEL_1975mv, kBOD_LEVEL_2000mv, kBOD_LEVEL_2025mv, kBOD_LEVEL_2050mv, kBOD_LEVEL_2075mv,
        kBOD_LEVEL_2100mv, kBOD_LEVEL_2125mv, kBOD_LEVEL_2150mv, kBOD_LEVEL_2175mv, kBOD_LEVEL_2200mv,
        kBOD_LEVEL_2225mv, kBOD_LEVEL_2250mv, kBOD_LEVEL_2275mv, kBOD_LEVEL_2300mv, kBOD_LEVEL_2325mv,
        kBOD_LEVEL_2350mv, kBOD_LEVEL_2375mv, kBOD_LEVEL_2400mv, kBOD_LEVEL_2425mv, kBOD_LEVEL_2450mv,
        kBOD_LEVEL_2475mv, kBOD_LEVEL_2500mv, kBOD_LEVEL_2525mv, kBOD_LEVEL_2550mv, kBOD_LEVEL_2575mv,
        kBOD_LEVEL_2600mv, kBOD_LEVEL_2625mv, kBOD_LEVEL_2650mv, kBOD_LEVEL_2675mv, kBOD_LEVEL_2700mv,
        kBOD_LEVEL_2725mv, kBOD_LEVEL_2750mv, kBOD_LEVEL_2775mv, kBOD_LEVEL_2800mv, kBOD_LEVEL_2825mv,
        kBOD_LEVEL_2850mv, kBOD_LEVEL_2875mv, kBOD_LEVEL_2900mv, kBOD_LEVEL_2925mv, kBOD_LEVEL_2950mv,
        kBOD_LEVEL_2975mv, kBOD_LEVEL_3000mv, kBOD_LEVEL_3025mv, kBOD_LEVEL_3050mv, kBOD_LEVEL_3075mv,
        kBOD_LEVEL_3100mv
    };

