zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/drivers/fsl_power.c
    if (instance > 1U || voltage == NULL)
    {
        return kStatus_InvalidArgument;
    }

    const uint32_t intMask = (instance == 0U)
        ? ANACTRL_BOD_DCDC_INT_CTRL_BOD1_INT_ENABLE_MASK
        : ANACTRL_BOD_DCDC_INT_CTRL_BOD2_INT_ENABLE_MASK;

    const uint32_t resetMask = (instance == 0U)
        ? (PMC_RESETCTRL_BOD1RESETENA_SECURE_MASK | PMC_RESETCTRL_BOD1RESETENA_SECURE_DP_MASK)
        : (PMC_RESETCTRL_BOD2RESETENA_SECURE_MASK | PMC_RESETCTRL_BOD2RESETENA_SECURE_DP_MASK);

    IRQn_Type nvicBodIrq             = (instance == 0U) ? BOD1_IRQn : BOD2_IRQn;
    void (*setBodLevel)(bod_level_t) = (instance == 0U) ? POWER_SetBod1Level : POWER_SetBod2Level;
    bool (*isBodActive)(void)        = (instance == 0U) ? POWER_IsBOD1Active : POWER_IsBOD2Active;

    int32_t direction;
    uint32_t bodActive;
    uint32_t previousBodActive;

    /* Store previous measurement as a static variable. Always start from previous measurement */
    static int32_t currentSetting = (int32_t)(ARRAY_SIZE(levelSettings) - 1U);
    const  int32_t maxIndex       = (int32_t)(ARRAY_SIZE(levelSettings) - 1U);

    /* Store interrupt settings */
    const uint32_t storedIntVal     = ANACTRL->BOD_DCDC_INT_CTRL & intMask;
    /* Store NVIC interrupt setting */
    const uint32_t storedNvicBodIrq = NVIC_GetEnableIRQ(nvicBodIrq);
    /* Store NVIC SYS interrupt setting */
    const uint32_t storedNvicSysIrq = NVIC_GetEnableIRQ(WDT_BOD_IRQn);
    /* Store reset settings */
    const uint32_t storedResetVal   = PMC->RESETCTRL & resetMask;

    /* Disable NVIC interrupts */
    NVIC_DisableIRQ(nvicBodIrq);
    NVIC_DisableIRQ(WDT_BOD_IRQn);

    /* Enable BOD interrupts */
    (instance == 0U ? EnableBOD1Interrupts : EnableBOD2Interrupts)();

    /* Disable BOD resets while measuring */
    (instance == 0U ? DisableBOD1Resets : DisableBOD2Resets)();

    /* Start from previous measurement */
    if (currentSetting < 0) 
    {
        currentSetting = 0;
    } 
    else if (currentSetting > maxIndex) 
    {
        currentSetting = maxIndex;
    }

    setBodLevel((bod_level_t)levelSettings[(size_t)currentSetting]);
    DelayUs(STABILIZATION_TIME_IN_US);

    /* Determine direction from current BOD state */
    bodActive         = isBodActive();
    previousBodActive = bodActive;
    direction         = bodActive ? -1 : 1;

    /* Walk the threshold until the status flips or bounds are reached */
    while (bodActive == previousBodActive)
    {
        int32_t next = currentSetting + direction;

        /* Stop if the next step would go out of range */
        if (next < 0 || next > maxIndex) 
        {
            break;
        }

        currentSetting = next;

        setBodLevel((bod_level_t)levelSettings[(size_t)currentSetting]);
        DelayUs(STABILIZATION_TIME_IN_US);

        previousBodActive = bodActive;
        bodActive         = isBodActive();
    }

    /* If Vbat_hv is above the last tested trigger, step up one (if possible) */
    if ((!bodActive) && (currentSetting < maxIndex))
    {
        currentSetting++;
    }

    /* Convert index to millivolts: 1100 mV + N * 25 mV */
    uint32_t mv = 1100u + (uint32_t)currentSetting * 25u;
    *voltage    = mv;

    /* Restore reset settings */
    PMC->RESETCTRL = (PMC->RESETCTRL & ~resetMask) | storedResetVal;

    /* Restore interrupt settings (clear then set only the masked bits) */
    ANACTRL->BOD_DCDC_INT_CTRL =
        (ANACTRL->BOD_DCDC_INT_CTRL & ~intMask) | storedIntVal;

    /* Restore NVIC interrupt enables */
    (storedNvicBodIrq ? NVIC_EnableIRQ : NVIC_DisableIRQ)(nvicBodIrq);
    (storedNvicSysIrq ? NVIC_EnableIRQ : NVIC_DisableIRQ)(WDT_BOD_IRQn);

    return kStatus_Success;
}

/**
 * @brief Delay execution for microseconds
 * @param delay Number of microseconds to delay
 */
static void DelayUs(uint32_t delay)
{
    SDK_DelayAtLeastUs(delay, SystemCoreClock);
}

/*******************************************************************************
 * Public functions
 ******************************************************************************/

/**
 * @brief Power cycle CPU and flash
 * 
 * Shuts off the Flash and executes WFI(), then powers up the Flash after wake-up event.
 * Shut off the Flash is done by hardware, then power up the Flash after wake-up event also.
 */
void POWER_PowerCycleCpuAndFlash(void)
{
    /* Store PDEN_BOD1/2 from PDRUNCFG register into AOREG1 for non retention modes */
    uint32_t pdruncfg0 = PMC->PDRUNCFG0;
    uint32_t pdenBod1 = (pdruncfg0 & PMC_PDRUNCFG0_PDEN_BOD1_MASK) >> PMC_PDRUNCFG0_PDEN_BOD1_SHIFT;
    uint32_t pdenBod2 = (pdruncfg0 & PMC_PDRUNCFG0_PDEN_BOD2_MASK) >> PMC_PDRUNCFG0_PDEN_BOD2_SHIFT;
    PMC->AOREG1 &= ~(uint32_t)(AOREG1_BOD1_MASK | AOREG1_BOD2_MASK);
    PMC->AOREG1 |= ((pdenBod1 << AOREG1_BOD1_SHIFT) | (pdenBod2 << AOREG1_BOD2_SHIFT));
    /* write values of PDEN_BOD1/2 bits from PDSLEEPCFG register to PDRUNCFG register. */
    uint32_t pdruncfg0_wo = pdruncfg0 & ~(PMC_PDRUNCFG0_PDEN_BOD1_MASK | PMC_PDRUNCFG0_PDEN_BOD2_MASK);
    /* makes use of identical bit positions in RUN and SLEEP register - this will never change */
    pdruncfg0_wo |= (PMC->PDSLEEPCFG0 & (PMC_PDSLEEPCFG0_PDEN_BOD1_MASK | PMC_PDSLEEPCFG0_PDEN_BOD2_MASK));
    PMC->PDRUNCFG0 = pdruncfg0_wo;

    /* Configure the Cortex-M33 in Deep Sleep mode */
    SCB->SCR = SCB->SCR | SCB_SCR_SLEEPDEEP_Msk;

    /* Enter in low power mode */
    __WFI();

    /* Configure the Cortex-M33 in Active mode */
    SCB->SCR = SCB->SCR & (~SCB_SCR_SLEEPDEEP_Msk);

    /* This is retention mode, restore the PDEN_BOD1 and PDEN_BOD2 values of the PMC_PDRUNCFG0 register */
    PMC->PDRUNCFG0 = pdruncfg0;
}

/**
 * @brief Perform system reset
 */
void POWER_Reset(void)
{
    PMC->RESETCTRL |= PMC_RESETCTRL_SWRRESETENABLE_MASK;
    SYSCON->SWR_RESET = 0x5A000001;

    while (1)
    {
        ;
    }
}

/**
 * @brief Initialize power management subsystem
 */
void POWER_Init(void)
{
    /* Write a 1b to the PMC_DCDC0_ENABLE_BYPASS bit followed by writing a zero.
       After these two actions, it is guaranteed that the LPBS switch is open. */
    PMC->DCDC0 |= PMC_DCDC0_ENABLE_BYPASS_MASK;
    PMC->DCDC0 &= ~PMC_DCDC0_ENABLE_BYPASS_MASK;

    /* Allow dcdc startup for Vbat < 2v5 e.g. when coming out of deepsleep/powerdown */
    PMC->DCDC0 |= PMC_DCDC0_ROBUST_STARTUP_DISABLE_MASK;

    /* Increase startup time of 32 MHz XTAL from HW default 160us to 288us (9*32us).
    According to datasheet typical value is 209us and max value 270us.   */
    POWER_XTAL32M_SetStartupTime(9);

    /*  There are different techniques to reduce SRAM current in low power modes.
     *  Amongst them are voltage Scaling and source biasing.
     *  But they can not be combined, it is either voltage scaling or source biasing.
     *  Validation must indicate which technique is the most optimal for DEEPSLEEP/POWERDOWN.
     *  if something is planned as part of validation For now voltage scaling is used in all Low Power modes,
     *  just like in Niobe4Mini. So source biasing must be disabled.
     */
    PMC->SRAMCTRL = (PMC->SRAMCTRL & (~PMC_SRAMCTRL_SMB_MASK)) | PMC_SRAMCTRL_SMB(3);

    /* Enable auto clock gating of SRAMS to be able to switch SRAM power mode and all the rest also at the same time */
    SYSCON->AUTOCLKGATEOVERRIDE =
        (SYSCON->AUTOCLKGATEOVERRIDE &
         ~(SYSCON_AUTOCLKGATEOVERRIDE_ROM_MASK | SYSCON_AUTOCLKGATEOVERRIDE_RAMX_CTRL_MASK |
           SYSCON_AUTOCLKGATEOVERRIDE_RAM0_CTRL_MASK | SYSCON_AUTOCLKGATEOVERRIDE_RAM1_CTRL_MASK |
           SYSCON_AUTOCLKGATEOVERRIDE_RAM2_CTRL_MASK | SYSCON_AUTOCLKGATEOVERRIDE_SYNC0_APB_MASK |
           SYSCON_AUTOCLKGATEOVERRIDE_SYNC1_APB_MASK | SYSCON_AUTOCLKGATEOVERRIDE_FLASH_MASK |
           SYSCON_AUTOCLKGATEOVERRIDE_FMC_MASK | SYSCON_AUTOCLKGATEOVERRIDE_CRCGEN_MASK |
           SYSCON_AUTOCLKGATEOVERRIDE_SDMA0_MASK | SYSCON_AUTOCLKGATEOVERRIDE_SDMA1_MASK |
           SYSCON_AUTOCLKGATEOVERRIDE_SYSCON_MASK)) |
        (0xC0DEU << SYSCON_AUTOCLKGATEOVERRIDE_ENABLEUPDATE_SHIFT);
    /* Note: there is no SYSCON_AUTOCLKGATEOVERRIDE for BLE RAM */

    /* Goto DEEPSLEEP (retention) mode in PMC Low-power modes DSLP and PWDN except when already in SHUTDOWN, then remain in SHUTDOWN */
    PMC->SRAMRETCTRL = PMC_SRAMRETCTRL_RETEN_RAMX0_MASK | PMC_SRAMRETCTRL_RETEN_RAMX1_MASK |
                       PMC_SRAMRETCTRL_RETEN_RAMX2_MASK | PMC_SRAMRETCTRL_RETEN_RAMX3_MASK |
                       PMC_SRAMRETCTRL_RETEN_RAM00_MASK | PMC_SRAMRETCTRL_RETEN_RAM10_MASK |
                       PMC_SRAMRETCTRL_RETEN_RAM20_MASK | PMC_SRAMRETCTRL_RETEN_RAMBLEDATA_MASK |
                       PMC_SRAMRETCTRL_RETEN_RAMBLESEQL_MASK;

    uint32_t pmcLdoMem = PMC->LDOMEM;
    /* Do not keep 1V from ACTIVE state but change to 0.6x V in low power mode  */
    pmcLdoMem |= PMC_LDOMEM_VADJ_PWD_MASK;
    /* Set 1 V for lowest power consumption */
    pmcLdoMem &= ~PMC_LDOMEM_VADJ_MASK;
    pmcLdoMem |= (kLDO_MEM_1000mv << PMC_LDOMEM_VADJ_SHIFT);
    PMC->LDOMEM = pmcLdoMem;

    uint32_t pmcLdoDig = PMC->LDODIG;
    /* Set 1 V for lowest power consumption */
    pmcLdoDig &= ~PMC_LDODIG_VADJ_MASK;
    pmcLdoDig |= (kLDO_DIG_1000mv << PMC_LDODIG_VADJ_SHIFT);
    PMC->LDODIG = pmcLdoDig;

    /* Enable LSActive for lowest power consumption */
    /* IMPORTANT: This bit must always be set to 1. Flash is characterized with this bit set. */
    FMU0->FCTRL |= FMU_FCTRL_LSACTIVE_MASK;

    /* restore PDEN_BOD1/2 from AOREG1 to PDRUNCFG register for non retention modes */
    uint32_t pdenBod1 = (PMC->AOREG1 & AOREG1_BOD1_MASK) >> AOREG1_BOD1_SHIFT;
    uint32_t pdenBod2 = (PMC->AOREG1 & AOREG1_BOD2_MASK) >> AOREG1_BOD2_SHIFT;
    uint32_t pdruncfg0 = PMC->PDRUNCFG0;
    pdruncfg0 &= ~(PMC_PDRUNCFG0_PDEN_BOD1_MASK | PMC_PDRUNCFG0_PDEN_BOD2_MASK);
    pdruncfg0 |= ((pdenBod1 << PMC_PDRUNCFG0_PDEN_BOD1_SHIFT) | (pdenBod2 << PMC_PDRUNCFG0_PDEN_BOD2_SHIFT));
    PMC->PDRUNCFG0 = pdruncfg0;

    /* restore PMC settings in XR_SM modes */
    uint32_t aoreg1 = PMC->AOREG1;
    
