zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/drivers/fsl_power.c
    /* Clear XR_SM mode in AOREG1 to be able to recover next time in case supply is not connected anymore and there is a
     * hang further down */
    /* POWER_DCDC_SetSupplyMode() will set it back. */
    PMC->AOREG1 &= ~(uint32_t)(AOREG1_DCDC_MODE_XR_SM_SS_MASK | AOREG1_DCDC_MODE_XR_SM_DS_MASK);
    if (aoreg1 & AOREG1_DCDC_MODE_XR_SM_SS_MASK)
    {
        POWER_DCDC_SetSupplyMode(kDCDC_MODE_XR_SM_SS);
    }
    else if (aoreg1 & AOREG1_DCDC_MODE_XR_SM_DS_MASK)
    {
        POWER_DCDC_SetSupplyMode(kDCDC_MODE_XR_SM_DS);
    }

    /* In case system woke up from os timer event in deep power down, PMC register 
     * needs to be cleared to avoid undesired future wakeup from ostimer.
     * (because PMC registers are not cleared automatically after reset or wakeup.) */
    PMC->OSTIMERr &= ~PMC_OSTIMER_DPDWAKEUPENABLE_MASK;

    /* Disable all unused clocks that are on by default after boot */
    CLOCK_DisableClock(kCLOCK_Rng);
    CLOCK_DisableClock(kCLOCK_Iocon);
    CLOCK_DisableClock(kCLOCK_Gpio0);
    CLOCK_DisableClock(kCLOCK_Sysctl);
    CLOCK_DisableClock(kCLOCK_HashCrypt);
    CLOCK_DisableClock(kCLOCK_Puf);
    CLOCK_DisableClock(kCLOCK_Casper);
}

/**
 * @brief Power off a peripheral
 * @param powerConfigBit Peripheral to power off
 */
void POWER_PeripheralPowerOff(power_config_bit_t powerConfigBit)
{
    PMC->PDRUNCFGSET0 = powerConfigBit;
}

/**
 * @brief Set 32K XTAL startup time
 * @param startupTime Startup time in milliseconds
 */
void POWER_XTAL32K_SetStartupTime(uint32_t startupTime)
{
    s_xtalStartupTimeMs = startupTime;
}

/**
 * @brief Power on a peripheral
 * @param powerConfigBit Peripheral to power on
 */
void POWER_PeripheralPowerOn(power_config_bit_t powerConfigBit)
{
    if (powerConfigBit & kPOWERCFG_XTAL32K)
    {
        if (PMC->PDRUNCFG0 & kPOWERCFG_XTAL32K) /* Check 32K XTAL not on yet (1 means off in PDRUNCFG0)*/
        {
            PMC->PDRUNCFGCLR0 = powerConfigBit;
            DelayUs(s_xtalStartupTimeMs * 1000); /* Delay configurable with API, in case customer uses different XTAL
                                                      configuration. */
        }
    }
    if (powerConfigBit & kPOWERCFG_FRO32K)
    {
        if (PMC->PDRUNCFG0 & kPOWERCFG_FRO32K) /* Check 32K FRO not on yet (1 means off in PDRUNCFG0)*/
        {
            PMC->PDRUNCFGCLR0 = powerConfigBit;
            DelayUs(DEFAULT_FRO_STARTUP_DELAY_MS * 1000); /* Delay NOT configurable with API, we assume FRO startup not to
                                                          vary too much. */
        }
    }
    else if(powerConfigBit & kPOWERCFG_BLE) /* Check 32MHz XTAL not on yet(1 means off in PDRUNCFG0)*/
    {
        if (PMC->PDRUNCFG0 & kPOWERCFG_BLE)
        {
            PMC->PDRUNCFGCLR0 = powerConfigBit;
            /* Wait until 32 MHz xtal osc is active*/
            while ((PMC_BLE_STATE != PMC_BLE_STATE_ENABLE_CLOCK_OUT) && (PMC_BLE_STATE != PMC_BLE_STATE_RADIO_ACTIVE))
            {
            }
        }
    }
    else
    {
        PMC->PDRUNCFGCLR0 = powerConfigBit;
    }
}

/**
 * @brief Disable SRAM segments
 * @param sramCtrl Bitmask of SRAM segments to disable
 */
void POWER_DisableSRAM(uint32_t sramCtrl)
{
    if (sramCtrl & kSRAM_CTRL_RAMX0)
    {
        if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAMX0_MASK) !=
            (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL0_RAMX0_LS_SHIFT))
        {
            uint32_t pmcSramCtrl0 = PMC->SRAMCTRL0;
            pmcSramCtrl0 &= ~PMC_SRAMCTRL0_RAMX0_MASK;
            pmcSramCtrl0 |= (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL0_RAMX0_LS_SHIFT);
            PMC->SRAMCTRL0 = pmcSramCtrl0;
        }
    }

    if (sramCtrl & kSRAM_CTRL_RAMX1)
    {
        if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAMX1_MASK) !=
            (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL0_RAMX1_LS_SHIFT))
        {
            uint32_t pmcSramCtrl0 = PMC->SRAMCTRL0;
            pmcSramCtrl0 &= ~PMC_SRAMCTRL0_RAMX1_MASK;
            pmcSramCtrl0 |= (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL0_RAMX1_LS_SHIFT);
            PMC->SRAMCTRL0 = pmcSramCtrl0;
        }
    }

    if (sramCtrl & kSRAM_CTRL_RAMX2)
    {
        if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAMX2_MASK) !=
            (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL0_RAMX2_LS_SHIFT))
        {
            uint32_t pmcSramCtrl0 = PMC->SRAMCTRL0;
            pmcSramCtrl0 &= ~PMC_SRAMCTRL0_RAMX2_MASK;
            pmcSramCtrl0 |= (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL0_RAMX2_LS_SHIFT);
            PMC->SRAMCTRL0 = pmcSramCtrl0;
        }
    }

    if (sramCtrl & kSRAM_CTRL_RAMX3)
    {
        if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAMX3_MASK) !=
            (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL0_RAMX3_LS_SHIFT))
        {
            uint32_t pmcSramCtrl0 = PMC->SRAMCTRL0;
            pmcSramCtrl0 &= ~PMC_SRAMCTRL0_RAMX3_MASK;
            pmcSramCtrl0 |= (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL0_RAMX3_LS_SHIFT);
            PMC->SRAMCTRL0 = pmcSramCtrl0;
        }
    }

    if (sramCtrl & kSRAM_CTRL_RAM00)
    {
        if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAM00_MASK) !=
            (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL0_RAM00_LS_SHIFT))
        {
            uint32_t pmcSramCtrl0 = PMC->SRAMCTRL0;
            pmcSramCtrl0 &= ~PMC_SRAMCTRL0_RAM00_MASK;
            pmcSramCtrl0 |= (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL0_RAM00_LS_SHIFT);
            PMC->SRAMCTRL0 = pmcSramCtrl0;
        }
    }

    if (sramCtrl & kSRAM_CTRL_RAM10)
    {
        if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAM10_MASK) !=
            (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL0_RAM10_LS_SHIFT))
        {
            uint32_t pmcSramCtrl0 = PMC->SRAMCTRL0;
            pmcSramCtrl0 &= ~PMC_SRAMCTRL0_RAM10_MASK;
            pmcSramCtrl0 |= (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL0_RAM10_LS_SHIFT);
            PMC->SRAMCTRL0 = pmcSramCtrl0;
        }
    }

    if (sramCtrl & kSRAM_CTRL_RAM20)
    {
        if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAM20_MASK) !=
            (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL0_RAM20_LS_SHIFT))
        {
            uint32_t pmcSramCtrl0 = PMC->SRAMCTRL0;
            pmcSramCtrl0 &= ~PMC_SRAMCTRL0_RAM20_MASK;
            pmcSramCtrl0 |= (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL0_RAM20_LS_SHIFT);
            PMC->SRAMCTRL0 = pmcSramCtrl0;
        }
    }

    if (sramCtrl & kSRAM_CTRL_RAMBLEDATA)
    {
        if ((PMC->SRAMCTRL1 & PMC_SRAMCTRL1_RAMBLEDATA_MASK) !=
            (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL1_RAMBLEDATA_LS_SHIFT))
        {
            uint32_t pmcSramCtrl1 = PMC->SRAMCTRL1;
            pmcSramCtrl1 &= ~PMC_SRAMCTRL1_RAMBLEDATA_MASK;
            pmcSramCtrl1 |= (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL1_RAMBLEDATA_LS_SHIFT);
            PMC->SRAMCTRL1 = pmcSramCtrl1;
        }
    }

