zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/drivers/fsl_power.c
    if (sramCtrl & kSRAM_CTRL_RAMBLESEQL)
    {
        if ((PMC->SRAMCTRL1 & PMC_SRAMCTRL1_RAMBLESEQL_MASK) !=
            (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL1_RAMBLESEQL_LS_SHIFT))
        {
            uint32_t pmcSramCtrl1 = PMC->SRAMCTRL1;
            pmcSramCtrl1 &= ~PMC_SRAMCTRL1_RAMBLESEQL_MASK;
            pmcSramCtrl1 |= (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL1_RAMBLESEQL_LS_SHIFT);
            PMC->SRAMCTRL1 = pmcSramCtrl1;
        }
    }
}

/**
 * @brief Enable SRAM segments
 * @param sramCtrl Bitmask of SRAM segments to enable
 */
void POWER_EnableSRAM(uint32_t sramCtrl)
{
    if (sramCtrl & kSRAM_CTRL_RAMX0) /* ON */
    {
        if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAMX0_MASK) != (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAMX0_LS_SHIFT))
        {
            uint32_t pmcSramCtrl0 = PMC->SRAMCTRL0;
            pmcSramCtrl0 &= ~PMC_SRAMCTRL0_RAMX0_MASK;
            pmcSramCtrl0 |= (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAMX0_LS_SHIFT);
            PMC->SRAMCTRL0 = pmcSramCtrl0;
            DelayUs(1); /* Wait until SRAM ready to be used */
        }
    }

    if (sramCtrl & kSRAM_CTRL_RAMX1) /* ON */
    {
        if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAMX1_MASK) != (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAMX1_LS_SHIFT))
        {
            uint32_t pmcSramCtrl0 = PMC->SRAMCTRL0;
            pmcSramCtrl0 &= ~PMC_SRAMCTRL0_RAMX1_MASK;
            pmcSramCtrl0 |= (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAMX1_LS_SHIFT);
            PMC->SRAMCTRL0 = pmcSramCtrl0;
            DelayUs(1); /* Wait until SRAM ready to be used */
        }
    }

    if (sramCtrl & kSRAM_CTRL_RAMX2) /* ON */
    {
        if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAMX2_MASK) != (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAMX2_LS_SHIFT))
        {
            uint32_t pmcSramCtrl0 = PMC->SRAMCTRL0;
            pmcSramCtrl0 &= ~PMC_SRAMCTRL0_RAMX2_MASK;
            pmcSramCtrl0 |= (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAMX2_LS_SHIFT);
            PMC->SRAMCTRL0 = pmcSramCtrl0;
            DelayUs(1); /* Wait until SRAM ready to be used */
        }
    }

    if (sramCtrl & kSRAM_CTRL_RAMX3) /* ON */
    {
        if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAMX3_MASK) != (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAMX3_LS_SHIFT))
        {
            uint32_t pmcSramCtrl0 = PMC->SRAMCTRL0;
            pmcSramCtrl0 &= ~PMC_SRAMCTRL0_RAMX3_MASK;
            pmcSramCtrl0 |= (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAMX3_LS_SHIFT);
            PMC->SRAMCTRL0 = pmcSramCtrl0;
            DelayUs(1); /* Wait until SRAM ready to be used */
        }
    }

    if (sramCtrl & kSRAM_CTRL_RAM00) /* ON */
    {
        if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAM00_MASK) != (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAM00_LS_SHIFT))
        {
            uint32_t pmcSramCtrl0 = PMC->SRAMCTRL0;
            pmcSramCtrl0 &= ~PMC_SRAMCTRL0_RAM00_MASK;
            pmcSramCtrl0 |= (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAM00_LS_SHIFT);
            PMC->SRAMCTRL0 = pmcSramCtrl0;
            DelayUs(4); /* Wait until SRAM ready to be used */
        }
    }

    if (sramCtrl & kSRAM_CTRL_RAM10) /* ON */
    {
        if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAM10_MASK) != (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAM10_LS_SHIFT))
        {
            uint32_t pmcSramCtrl0 = PMC->SRAMCTRL0;
            pmcSramCtrl0 &= ~PMC_SRAMCTRL0_RAM10_MASK;
            pmcSramCtrl0 |= (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAM10_LS_SHIFT);
            PMC->SRAMCTRL0 = pmcSramCtrl0;
            DelayUs(6); /* Wait until SRAM ready to be used */
        }
    }

    if (sramCtrl & kSRAM_CTRL_RAM20) /* ON */
    {
        if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAM20_MASK) != (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAM20_LS_SHIFT))
        {
            uint32_t pmcSramCtrl0 = PMC->SRAMCTRL0;
            pmcSramCtrl0 &= ~PMC_SRAMCTRL0_RAM20_MASK;
            pmcSramCtrl0 |= (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAM20_LS_SHIFT);
            PMC->SRAMCTRL0 = pmcSramCtrl0;
            DelayUs(12); /* Wait until SRAM ready to be used */
        }
    }

    if (sramCtrl & kSRAM_CTRL_RAMBLEDATA) /* ON */
    {
        if ((PMC->SRAMCTRL1 & PMC_SRAMCTRL1_RAMBLEDATA_MASK) !=
            (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL1_RAMBLEDATA_LS_SHIFT))
        {
            uint32_t pmcSramCtrl1 = PMC->SRAMCTRL1;
            pmcSramCtrl1 &= ~PMC_SRAMCTRL1_RAMBLEDATA_MASK;
            pmcSramCtrl1 |= (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL1_RAMBLEDATA_LS_SHIFT);
            PMC->SRAMCTRL1 = pmcSramCtrl1;
            DelayUs(4); /* Wait until SRAM ready to be used */
        }
    }

    if (sramCtrl & kSRAM_CTRL_RAMBLESEQL) /* ON */
    {
        if ((PMC->SRAMCTRL1 & PMC_SRAMCTRL1_RAMBLESEQL_MASK) !=
            (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL1_RAMBLESEQL_LS_SHIFT))
        {
            uint32_t pmcSramCtrl1 = PMC->SRAMCTRL1;
            pmcSramCtrl1 &= ~PMC_SRAMCTRL1_RAMBLESEQL_MASK;
            pmcSramCtrl1 |= (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL1_RAMBLESEQL_LS_SHIFT);
            PMC->SRAMCTRL1 = pmcSramCtrl1;
            DelayUs(1); /* Wait until SRAM ready to be used */
        }
    }
}

/**
 * @brief Get current SRAM configuration
 * @return Bitmask of enabled SRAM segments
 */
uint32_t POWER_GetSRAMConfig(void)
{
    uint32_t sramCtrl = 0;

    if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAMX0_MASK) != (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAMX0_LS_SHIFT))
    {
        sramCtrl |= kSRAM_CTRL_RAMX0;
    }

    if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAMX1_MASK) != (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAMX1_LS_SHIFT))
    {
        sramCtrl |= kSRAM_CTRL_RAMX1;
    }

    if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAMX2_MASK) != (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAMX2_LS_SHIFT))
    {
        sramCtrl |= kSRAM_CTRL_RAMX2;
    }

    if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAMX3_MASK) != (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAMX3_LS_SHIFT))
    {
        sramCtrl |= kSRAM_CTRL_RAMX3;
    }

