zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/drivers/fsl_power.c
    if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAM00_MASK) == (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAM00_LS_SHIFT))
    {
        sramCtrl |= kSRAM_CTRL_RAM00;
    }

    if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAM10_MASK) == (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAM10_LS_SHIFT))
    {
        sramCtrl |= kSRAM_CTRL_RAM10;
    }

    if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAM20_MASK) == (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAM20_LS_SHIFT))
    {
        sramCtrl |= kSRAM_CTRL_RAM20;
    }

    if ((PMC->SRAMCTRL1 & PMC_SRAMCTRL1_RAMBLEDATA_MASK) ==
        (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL1_RAMBLEDATA_LS_SHIFT))
    {
        sramCtrl |= kSRAM_CTRL_RAMBLEDATA;
    }

    if ((PMC->SRAMCTRL1 & PMC_SRAMCTRL1_RAMBLESEQL_MASK) ==
        (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL1_RAMBLESEQL_LS_SHIFT))
    {
        sramCtrl |= kSRAM_CTRL_RAMBLESEQL;
    }
    return sramCtrl;
}

/**
 * @brief Enter sleep mode
 * 
 * Stops CPU but continues execution after wakeup
 */
void POWER_EnterSleep(void)
{
    uint32_t pmsk;
    pmsk = DisableGlobalIRQ();

    SCB->SCR &= ~SCB_SCR_SLEEPDEEP_Msk;
    __WFI();

    EnableGlobalIRQ(pmsk);
}

/**
 * @brief Enter deep sleep mode
 * @param excludeFromPd Bitmask of peripherals to keep powered
 * @param wakeupInterrupts Bitmask of interrupts that can wake the system
 * @return Status of operation
 */
status_t POWER_EnterDeepSleep(uint32_t excludeFromPd, uint64_t wakeupInterrupts)
{
    uint32_t cpu0NmiEnable;
    uint32_t cpu0IntEnable0;
    uint32_t cpu0IntEnable1;
    uint32_t restoreClockSettings = 0;
    uint32_t flashReadWaitStates;
    uint32_t coreSysClkConfiguration;

    /* Validate input. */
    /* Only the following peripherals can be excluded from power down */
    if (excludeFromPd & ~(uint32_t)kEXCLUDE_FROM_PD_LIMITATION_MASK_DEEPSLEEP)
    {
        return kStatus_InvalidArgument;
    }
    /* kLOWPOWERCFG_BLE_WUP may only be set when either kLOWPOWERCFG_FRO32K or kLOWPOWERCFG_XTAL32K is set. */
    if (excludeFromPd & kLOWPOWERCFG_BLE_WUP)
    {
        if (!(excludeFromPd & (kLOWPOWERCFG_FRO32K | kLOWPOWERCFG_XTAL32K)))
        {
            return kStatus_InvalidArgument;
        }
    }
    /* FRO192M may only be set when HFDSM is set. */
    if (excludeFromPd & kLOWPOWERCFG_FRO192M)
    {
        if (!(excludeFromPd & kLOWPOWERCFG_HFDSM))
        {
            return kStatus_InvalidArgument;
        }
    }

    /* BOD resets: when enabled, BOD should stay powered. */
    uint32_t pmcResetCtrl = PMC->RESETCTRL;
    if (((pmcResetCtrl & PMC_RESETCTRL_BOD1RESETENA_SECURE_MASK) != 2U << PMC_RESETCTRL_BOD1RESETENA_SECURE_SHIFT) ||
        ((pmcResetCtrl & PMC_RESETCTRL_BOD1RESETENA_SECURE_DP_MASK) !=
         2U << PMC_RESETCTRL_BOD1RESETENA_SECURE_DP_SHIFT))
    {
        if (!(excludeFromPd & kLOWPOWERCFG_BOD1))
        {
            return kStatus_InvalidArgument;
        }
    }
    if (((pmcResetCtrl & PMC_RESETCTRL_BOD2RESETENA_SECURE_MASK) != 2U << PMC_RESETCTRL_BOD2RESETENA_SECURE_SHIFT) ||
        ((pmcResetCtrl & PMC_RESETCTRL_BOD2RESETENA_SECURE_DP_MASK) !=
         2U << PMC_RESETCTRL_BOD2RESETENA_SECURE_DP_SHIFT))
    {
        if (!(excludeFromPd & kLOWPOWERCFG_BOD2))
        {
            return kStatus_InvalidArgument;
        }
    }

    /* No CTIMER and UTICK at 1MHz during DEEPSLEEP with LDO_DIG = 0.6x V. */
    if (!(excludeFromPd & kLOWPOWERCFG_HFDSM)) // not 1V mode
    {
        if (excludeFromPd & kLOWPOWERCFG_FRO1M) // FRO1M enables
        {
            if (SYSCON->AHBCLKCTRL.AHBCLKCTRL1 & SYSCON_AHBCLKCTRL1_UTICK_MASK) // UTICK is always connected to FRO1M
            {
                return kStatus_InvalidArgument;
            }
            /* CTIMER can be connected directly to FRO1M, or via main clock direct to FRO1M */
            if (((SYSCON->CTIMERCLKSELX[0] & SYSCON_CTIMERCLKSEL0_SEL_MASK) == 4) |
                ((SYSCON->CTIMERCLKSELX[1] & SYSCON_CTIMERCLKSEL1_SEL_MASK) == 4) |
                ((SYSCON->CTIMERCLKSELX[2] & SYSCON_CTIMERCLKSEL2_SEL_MASK) == 4) |
                ((SYSCON->CTIMERCLKSELX[3] & SYSCON_CTIMERCLKSEL3_SEL_MASK) == 4) |
                ((SYSCON->CTIMERCLKSELX[4] & SYSCON_CTIMERCLKSEL4_SEL_MASK) == 4))
            {
                return kStatus_InvalidArgument;
            }
            if (((SYSCON->MAINCLKSELA & SYSCON_MAINCLKSELA_SEL_MASK) == 2) &&
                ((SYSCON->MAINCLKSELB & SYSCON_MAINCLKSELB_SEL_MASK) == 0))
            {
                if (((SYSCON->CTIMERCLKSELX[0] & SYSCON_CTIMERCLKSEL0_SEL_MASK) == 0) |
                    ((SYSCON->CTIMERCLKSELX[1] & SYSCON_CTIMERCLKSEL1_SEL_MASK) == 0) |
                    ((SYSCON->CTIMERCLKSELX[2] & SYSCON_CTIMERCLKSEL2_SEL_MASK) == 0) |
                    ((SYSCON->CTIMERCLKSELX[3] & SYSCON_CTIMERCLKSEL3_SEL_MASK) == 0) |
                    ((SYSCON->CTIMERCLKSELX[4] & SYSCON_CTIMERCLKSEL4_SEL_MASK) == 0))
                {
                    return kStatus_InvalidArgument;
                }
            }
        }
    }

    status_t status = SetPowerConfiguration(kLP_MODE_DEEPSLEEP, &excludeFromPd);
    if (status != kStatus_Success)
    {
        return status;
    }

    /* Mask all sleepcfg0 register bits. */
    uint32_t pmcSleepcfg0 = ~(excludeFromPd & EXCLUDE_FROM_PD_TO_SLEEPCFG0_MASK);

    pmcSleepcfg0 &= ~PMC_PDSLEEPCFG0_PDEN_CORE_MASK; /* Keep core enabled */
    pmcSleepcfg0 &= ~(PMC_PDSLEEPCFG0_PDEN_LDOMEM_MASK | PMC_PDSLEEPCFG0_PDEN_LDODIG_MASK); /* Keep ldo's enabled */

    /* Check High Frequency Deep Sleep Mode - set LDO DIG voltage */
    uint32_t pmcLdoDig = PMC->LDODIG;
    pmcLdoDig &= ~PMC_LDODIG_VADJ_PWD_MASK;
    pmcSleepcfg0 &= ~PMC_PDSLEEPCFG0_PDEN_BIAS_MASK;  /* Clear bias bits */
    if (excludeFromPd & kLOWPOWERCFG_HFDSM)
    {
        pmcSleepcfg0 |= PMC_PDSLEEPCFG0_PDEN_BIAS_0_63;
        pmcSleepcfg0 &= ~(PMC_PDSLEEPCFG0_PDEN_LDODIG_MASK);
    }
    else
    {
        pmcLdoDig |= PMC_LDODIG_VADJ_PWD_MASK;
        pmcSleepcfg0 |= PMC_PDSLEEPCFG0_PDEN_BIAS_0_63; 
    }
    PMC->LDODIG = pmcLdoDig;

