zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/drivers/fsl_power.c
    /* Check if link layer retention is enabled */
    if (excludeFromPd & kLOWPOWERCFG_BLE_WUP)
    {
        pmcSleepcfg0 &= ~(PMC_PDSLEEPCFG0_PDEN_BLE_MASK);
    }

    /* Lower System Clock to FRO12Mhz if necessary */
    if (((SYSCON->MAINCLKSELA == MAINCLKSELA_FRO_12MHz) && (SYSCON->MAINCLKSELB == MAINCLKSELB_MAINCLKAOUT)) ||
        ((SYSCON->MAINCLKSELA == MAINCLKSELA_FRO_1MHz) && (SYSCON->MAINCLKSELB == MAINCLKSELB_MAINCLKAOUT)) ||
        (SYSCON->MAINCLKSELB == MAINCLKSELB_32K_OSC) || (SYSCON->MAINCLKSELB == MAINCLKSELB_32K_OSC_ALTERNATE_VALUE1))
    {
    }
    else
    {
        /* Switch System Clock to FRO12Mhz(the configuration before calling this function will be restored back) */
        flashReadWaitStates        = CLOCK_GetFLASHAccessCycles();
        coreSysClkConfiguration = GetCoreSysClkConfiguration();
        CLOCK_SetupFROClocking(kFreq_12MHz);
        CLOCK_SetFLASHAccessCyclesForFreq(
            kFreq_12MHz);
        restoreClockSettings = 1;
    }

    /* Set excluded peripherals */
    PMC->PDSLEEPCFG0 = pmcSleepcfg0;

    PMC->CTRL = (LOWPOWER_CTRL_LPMODE_DEEPSLEEP << PMC_CTRL_LPMODE_SHIFT) |
                (LOWPOWER_CTRL_SELCLOCK_1MHZ << PMC_CTRL_SELCLOCK_SHIFT) |
                (LOWPOWER_CTRL_POFFMODE_OFF << PMC_CTRL_POFFMODE_SHIFT);

    cpu0NmiEnable = SYSCON->NMISRC & SYSCON_NMISRC_NMIENCPU0_MASK; /* Save the configuration of the NMI Register */
    SYSCON->NMISRC &= ~SYSCON_NMISRC_NMIENCPU0_MASK;                 /* Disable NMI of CPU0 */

    /*
     * Enable wake up interrupt.
     * Rational : we enable each interrupt (NVIC->ISER) that can wake up the CPU here (before the __disable_irq()
     * below): Hence, if an interrupt was pending and not treated before (for any reason), the CPU will jump to that
     *            interrupt handler before trying to enter the low power mode.
     *            VERY IMPORTANT : Also, any interrupt set in NVIC->ISER, even though __disable_irq(), will make the CPU
     *                             go out of the Deep Sleep mode.
     */

    /* But first save the configuration of the CPU interrupt set enable Registers */
    cpu0IntEnable0 = NVIC->ISER[0];
    cpu0IntEnable1 = NVIC->ISER[1];

    NVIC->ISER[0] = (uint32_t)(wakeupInterrupts & 0xFFFFFFFF);
    NVIC->ISER[1] = (uint32_t)((wakeupInterrupts >> 32) & 0xFFFFFFFF);

    /* Enable wake-up sources */
    SYSCON->STARTER[0] = (uint32_t)(wakeupInterrupts & 0xFFFFFFFF);
    SYSCON->STARTER[1] = (uint32_t)((wakeupInterrupts >> 32) & 0xFFFFFFFF);

    uint32_t savedPrimask = 0;

    /* Make sure DEEP POWER DOWN reset is disabled else DeepSleep will reset iso. continue */
    PMC->RESETCTRL &= (~PMC_RESETCTRL_DPDWAKEUPRESETENABLE_MASK);

    /* Disable all IRQs */
    savedPrimask = DisableGlobalIRQ();

    /* Disable the Flash, execute _WFI() instruction then enable the Flash after wake up event */
    POWER_PowerCycleCpuAndFlash();

    if (restoreClockSettings == 1)
    {
        CLOCK_SetFLASHAccessCycles(
            flashReadWaitStates);
        SetCoreSysClkConfiguration(coreSysClkConfiguration);
    }

    /* Enable all interrupts */
    EnableGlobalIRQ(savedPrimask);

    /* Restore ACTIVE mode to allow using normal WFI again */
    PMC->CTRL = (LOWPOWER_CTRL_LPMODE_ACTIVE << PMC_CTRL_LPMODE_SHIFT) |
                (LOWPOWER_CTRL_SELCLOCK_1MHZ << PMC_CTRL_SELCLOCK_SHIFT) |
                (LOWPOWER_CTRL_POFFMODE_OFF << PMC_CTRL_POFFMODE_SHIFT);

    /* Restore the configuration of the NMI Register */
    SYSCON->NMISRC |= cpu0NmiEnable;

    /* Restore the configuration of the CPU interrupt enable Registers */
    NVIC->ISER[0] = cpu0IntEnable0;
    NVIC->ISER[1] = cpu0IntEnable1;

    return kStatus_Success;
}

/**
 * @brief Enter power down mode
 * @param excludeFromPd Bitmask of peripherals to keep powered
 * @param wakeupInterrupts Bitmask of interrupts that can wake the system
 * @param cpuRetentionCtrl CPU retention control flag
 * @return Status of operation
 */
status_t POWER_EnterPowerDown(uint32_t excludeFromPd, uint64_t wakeupInterrupts, uint32_t cpuRetentionCtrl)
{
    uint32_t cpu0NmiEnable;
    uint32_t cpu0IntEnable0;
    uint32_t cpu0IntEnable1;
    uint32_t anactrlBodDcdcIntCtrl;

    /* Validate input. */
    /* Only the following peripherals can be excluded from power down */
    if (excludeFromPd & ~(uint32_t)kEXCLUDE_FROM_PD_LIMITATION_MASK_POWERDOWN)
    {
        return kStatus_InvalidArgument;
    }
    /* kLOWPOWERCFG_BLE_WUP may only be set when either kLOWPOWERCFG_FRO32K or kLOWPOWERCFG_XTAL32K is set. */
    if (excludeFromPd & kLOWPOWERCFG_BLE_WUP)
    {
        if (!(excludeFromPd & (kLOWPOWERCFG_FRO32K | kLOWPOWERCFG_XTAL32K)))
        {
            return kStatus_InvalidArgument;
        }
    }

    /* BOD resets: when enabled, BOD should stay powered. */
    uint32_t pmcResetCtrl = PMC->RESETCTRL;
    if (((pmcResetCtrl & PMC_RESETCTRL_BOD1RESETENA_SECURE_MASK) != 2U << PMC_RESETCTRL_BOD1RESETENA_SECURE_SHIFT) ||
        ((pmcResetCtrl & PMC_RESETCTRL_BOD1RESETENA_SECURE_DP_MASK) !=
         2U << PMC_RESETCTRL_BOD1RESETENA_SECURE_DP_SHIFT))
    {
        if (!(excludeFromPd & kLOWPOWERCFG_BOD1))
        {
            return kStatus_InvalidArgument;
        }
    }
    if (((pmcResetCtrl & PMC_RESETCTRL_BOD2RESETENA_SECURE_MASK) != 2U << PMC_RESETCTRL_BOD2RESETENA_SECURE_SHIFT) ||
        ((pmcResetCtrl & PMC_RESETCTRL_BOD2RESETENA_SECURE_DP_MASK) !=
         2U << PMC_RESETCTRL_BOD2RESETENA_SECURE_DP_SHIFT))
    {
        if (!(excludeFromPd & kLOWPOWERCFG_BOD2))
        {
            return kStatus_InvalidArgument;
        }
    }

    if (wakeupInterrupts & ~(kWAKEUP_GINT0 | kWAKEUP_FLEXCOMM0 | kWAKEUP_BLE_SLP_TMR | kWAKEUP_RTC |
                              kWAKEUP_OS_EVENT /* | wakeup pin as gpio */))
    {
        return kStatus_InvalidArgument;
    }

    status_t status = SetPowerConfiguration(kLP_MODE_POWERDOWN, &excludeFromPd);
    if (status != kStatus_Success)
    {
        return status;
    }

    uint32_t pmcSleepcfg0 = ~(excludeFromPd & EXCLUDE_FROM_PD_TO_SLEEPCFG0_MASK);

    pmcSleepcfg0 &= ~PMC_PDSLEEPCFG0_PDEN_BIAS_MASK; /* Clear bias bits */
    if (excludeFromPd & (kLOWPOWERCFG_DCDC | kLOWPOWERCFG_BOD1 | kLOWPOWERCFG_BOD2))
    {
        pmcSleepcfg0 |= PMC_PDSLEEPCFG0_PDEN_BIAS_0_63;
    }
    else
    {
        pmcSleepcfg0 |= PMC_PDSLEEPCFG0_PDEN_BIAS_0_66;
    }

    PMC->LDODIG |= PMC_LDODIG_VADJ_PWD_MASK;

