zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/drivers/fsl_power.c
    pmcSleepcfg0 &= ~PMC_PDSLEEPCFG0_PDEN_LDOMEM_MASK;
    pmcSleepcfg0 &= ~PMC_PDSLEEPCFG0_PDEN_LDODIG_MASK;

    /* Check if link layer retention is enabled */
    if (excludeFromPd & kLOWPOWERCFG_BLE_WUP)
    {
        pmcSleepcfg0 &= ~(PMC_PDSLEEPCFG0_PDEN_BLE_MASK);
    }

    /* CPU retention control */
    SYSCON->FUNCRETENTIONCTRL &=
        (~(SYSCON_FUNCRETENTIONCTRL_FUNCRETENA_MASK | SYSCON_FUNCRETENTIONCTRL_RET_START_MASK));
    if (cpuRetentionCtrl)
    {
        SYSCON->FUNCRETENTIONCTRL |=
            (SYSCON_FUNCRETENTIONCTRL_FUNCRETENA_MASK |
             (((CPU_RETENTION_RAMX_STORAGE_START_ADDR >> 2) << SYSCON_FUNCRETENTIONCTRL_RET_START_SHIFT) &
              SYSCON_FUNCRETENTIONCTRL_RET_START_MASK));
        SavePinRegisters();
    }
    /* Switch System Clock to FRO12Mhz (the configuration before calling this function will be restored back) */
    uint32_t flashReadWaitStates        = CLOCK_GetFLASHAccessCycles();
    uint32_t coreSysClkConfiguration = GetCoreSysClkConfiguration();

    CLOCK_SetupFROClocking(kFreq_12MHz);
    CLOCK_SetFLASHAccessCyclesForFreq(
        kFreq_12MHz);

    /* Set excluded peripherals */
    PMC->PDSLEEPCFG0 = pmcSleepcfg0;

    PMC->CTRL = (LOWPOWER_CTRL_LPMODE_POWERDOWN << PMC_CTRL_LPMODE_SHIFT) |
                (LOWPOWER_CTRL_SELCLOCK_1MHZ << PMC_CTRL_SELCLOCK_SHIFT) |
                (LOWPOWER_CTRL_POFFMODE_OFF << PMC_CTRL_POFFMODE_SHIFT);

    cpu0NmiEnable = SYSCON->NMISRC & SYSCON_NMISRC_NMIENCPU0_MASK; /* Save the configuration of the NMI Register */
    SYSCON->NMISRC &= ~SYSCON_NMISRC_NMIENCPU0_MASK;                 /* Disable NMI of CPU0 */

    /*
     * Enable wake up interrupt.
     * Rational : we enable each interrupt (NVIC->ISER) that can wake up the CPU here (before the __disable_irq()
     * below): Hence, if an interrupt was pending and not treated before (for any reason), the CPU will jump to that
     *            interrupt handler before trying to enter the low power mode.
     *            VERY IMPORTANT : Also, any interrupt set in NVIC->ISER, even though __disable_irq(), will make the CPU
     *                             go out of the Deep Sleep mode.
     */
    uint32_t interruptEnables0 = (uint32_t)(wakeupInterrupts & 0xFFFFFFFF);
    uint32_t interruptEnables1 = (uint32_t)((wakeupInterrupts >> 32) & 0xFFFFFFFF);
    uint32_t wakeupSources0    = interruptEnables0;
    uint32_t wakeupSources1    = interruptEnables1;

    if (cpuRetentionCtrl)
    {
        if (wakeupInterrupts & kWAKEUP_BLE_SLP_TMR)
        {
            /* Replace sleep timer irq (23) by wakeup state transition irq (31)
            and clear interrupt request flag to prevent isr execution at wakeup. */
            ANACTRL->BLE_CTRL = ANACTRL_BLE_CTRL_BLE_DST_INT_CLR_MASK;
            interruptEnables0 &= ~(uint32_t)kWAKEUP_BLE_SLP_TMR; /* Disable IRQ */
            interruptEnables0 |= kWAKEUP_WAKE_DSLP; /* Replace by state transition irq */
        }
        PMC->RESETCAUSE = PMC->RESETCAUSE; /* Clear reset cause */
    }

    /* Save the configuration of the CPU interrupt set enable Registers */
    cpu0IntEnable0 = NVIC->ISER[0];
    cpu0IntEnable1 = NVIC->ISER[1];

    NVIC->ISER[0] = interruptEnables0;
    NVIC->ISER[1] = interruptEnables1;

    /* Enable wake-up sources */
    SYSCON->STARTER[0] = wakeupSources0;
    SYSCON->STARTER[1] = wakeupSources1;

    uint32_t savedPrimask = 0;

    /* Make sure DEEP POWER DOWN reset is disabled else PowerDown with cpu retention will still reset */
    PMC->RESETCTRL &= (~PMC_RESETCTRL_DPDWAKEUPRESETENABLE_MASK);

    /* Disable all IRQs */
    savedPrimask = DisableGlobalIRQ();

    /*
     * From here :
     *  1 - If an interrupt that is enable occurs,
     *      the _WFI instruction will not be executed and we won't enter in POWER DOWN.
     *  2 - If an interrupt that is not enable occurs, there is no consequence neither
     *      on the execution of the low power mode nor on the behaviour of the CPU.
     */

    /* Store BOD interrupt enables to be able to restore them later. */
    anactrlBodDcdcIntCtrl = ANACTRL->BOD_DCDC_INT_CTRL;

    /* Disable the Flash, execute _WFI() instruction then enable the Flash after wake up event */
    POWER_PowerCycleCpuAndFlash();

    /* Only clearing the bit is required as the PMC must have kept its state. */
    PMC->DCDC0 &= ~PMC_DCDC0_ENABLE_BYPASS_MASK;

    /*
     * We can reach this point for 2 reasons:
     * 1 - We are coming out from POWER DOWN mode with CPU state retention. Assumption is that the SRAM
     *     containing the stack used to call this function shall be preserved during low power.
     * 2 - We didn't enter the POWER DOWN mode because a wake up interrupt popped up just
     *     before entering the POWER DOWN mode (as a consequence, the WFI() has been ignored)
     */

    CLOCK_SetFLASHAccessCycles(
        flashReadWaitStates);
    SetCoreSysClkConfiguration(coreSysClkConfiguration);

    if (cpuRetentionCtrl)
    {
        /* Pin registers are lost after PD with cpu retention */
        RestorePinRegisters();
    }

    /* Enable all interrupts */
    EnableGlobalIRQ(savedPrimask);

    /* Restore ACTIVE mode to allow using normal WFI again */
    PMC->CTRL = (PMC->CTRL & (~PMC_CTRL_LPMODE_MASK)) | (LOWPOWER_CTRL_LPMODE_ACTIVE << PMC_CTRL_LPMODE_SHIFT);

    /*** We'll reach this point in case of POWERDOWN with CPU retention or if the POWERDOWN has not been taken (for
      instance because an interrupt is pending). In case of CPU retention, assumption is that the SRAM containing the
      stack used to call this function shall be preserved during low power ***/

    /* Following code is to reset PUF to remove over consumption */
    /* Enable PUF register clock to access register */
    SYSCON->AHBCLKCTRLSET[2] = SYSCON_AHBCLKCTRL2_PUF_MASK;
    /* Release PUF reset */
    SYSCON->PRESETCTRLCLR[2] = SYSCON_PRESETCTRL2_PUF_RST_MASK;
    /* Enable PUF SRAM */
    PUF_SRAM_CTRL->CFG |= PUF_SRAM_CTRL_CFG_ENABLE_MASK | PUF_SRAM_CTRL_CFG_CKGATING_MASK;

    /* Disable PUF register clock. */
    /* Delaying the line of code below until the PUF State Machine execution is completed:
       Shutting down the clock too early will prevent the state machine from reaching the end.
       => Wait for status bit in PUF Controller Registers before stop PUF clock.*/
    while (!(PUF_SRAM_CTRL->INT_STATUS & PUF_SRAM_CTRL_INT_STATUS_READY_MASK))
        ;
    SYSCON->AHBCLKCTRLCLR[2] = SYSCON_AHBCLKCTRL2_PUF_MASK;

    /* Restore the configuration of the NMI Register */
    SYSCON->NMISRC |= cpu0NmiEnable;

