zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/drivers/fsl_power.c
    /* Restore the configuration of the CPU interrupt enable Registers (because they have been overwritten inside the
     * low power API */
    NVIC->ISER[0] = cpu0IntEnable0;
    NVIC->ISER[1] = cpu0IntEnable1;

    /* Restore BOD interrupt enables. */
    ANACTRL->BOD_DCDC_INT_CTRL = anactrlBodDcdcIntCtrl;

    return kStatus_Success;
}

/**
 * @brief Enter deep power down mode
 * @param excludeFromPd Bitmask of peripherals to keep powered
 * @param wakeupInterrupts Bitmask of interrupts that can wake the system
 * @param wakeupIoCtrl Wakeup I/O control configuration
 * @return Status of operation
 */
status_t POWER_EnterDeepPowerDown(uint32_t excludeFromPd, uint64_t wakeupInterrupts, uint32_t wakeupIoCtrl)
{
    /* Validate input. */
    /* Only the following peripherals can be excluded from deep power down: */
    if (excludeFromPd & ~(uint32_t)kEXCLUDE_FROM_PD_LIMITATION_MASK_DEEPPOWERDOWN)
    {
        return kStatus_InvalidArgument;
    }
    /* BOD resets: when enabled, BOD should stay powered */
    uint32_t pmcResetCtrl = PMC->RESETCTRL;
    if (((pmcResetCtrl & PMC_RESETCTRL_BOD1RESETENA_SECURE_MASK) != 2U << PMC_RESETCTRL_BOD1RESETENA_SECURE_SHIFT) ||
        ((pmcResetCtrl & PMC_RESETCTRL_BOD1RESETENA_SECURE_DP_MASK) !=
         2U << PMC_RESETCTRL_BOD1RESETENA_SECURE_DP_SHIFT))
    {
        if (!(excludeFromPd & kLOWPOWERCFG_BOD1))
        {
            return kStatus_InvalidArgument;
        }
    }
    if (((pmcResetCtrl & PMC_RESETCTRL_BOD2RESETENA_SECURE_MASK) != 2U << PMC_RESETCTRL_BOD2RESETENA_SECURE_SHIFT) ||
        ((pmcResetCtrl & PMC_RESETCTRL_BOD2RESETENA_SECURE_DP_MASK) !=
         2U << PMC_RESETCTRL_BOD2RESETENA_SECURE_DP_SHIFT))
    {
        if (!(excludeFromPd & kLOWPOWERCFG_BOD2))
        {
            return kStatus_InvalidArgument;
        }
    }

    if (wakeupInterrupts & ~(kWAKEUP_RTC | kWAKEUP_OS_EVENT | kWAKEUP_WAKE_PAD))
    {
        return kStatus_InvalidArgument;
    }

    status_t status = SetPowerConfiguration(kLP_MODE_DEEPPOWERDOWN, &excludeFromPd);
    if (status != kStatus_Success)
    {
        return status;
    }

    if (wakeupInterrupts == kWAKEUP_RTC)
    {
        RTC->CTRL |=
            RTC_CTRL_WAKEDPD_EN_MASK;
    }

    uint32_t pmcSleepcfg0 = ~(excludeFromPd & EXCLUDE_FROM_PD_TO_SLEEPCFG0_MASK);

    pmcSleepcfg0 &= ~PMC_PDSLEEPCFG0_PDEN_BIAS_MASK; /* Clear bias bits */
    if (excludeFromPd & (kLOWPOWERCFG_DCDC | kLOWPOWERCFG_BOD1 | kLOWPOWERCFG_BOD2))
    {
        pmcSleepcfg0 |= PMC_PDSLEEPCFG0_PDEN_BIAS_0_63;
        PMC->LDODIG |= PMC_LDODIG_VADJ_PWD_MASK;
    }
    else
    {
        pmcSleepcfg0 |= PMC_PDSLEEPCFG0_PDEN_BIAS_DISABLED;
    }

    /* Switch System Clock to FRO12Mhz */
    CLOCK_SetupFROClocking(kFreq_12MHz);
    CLOCK_SetFLASHAccessCyclesForFreq(
        kFreq_12MHz);

    /* Set excluded peripherals */
    PMC->PDSLEEPCFG0 = pmcSleepcfg0;

    PMC->CTRL = (LOWPOWER_CTRL_LPMODE_DEEPPOWERDOWN << PMC_CTRL_LPMODE_SHIFT) |
                (LOWPOWER_CTRL_SELCLOCK_1MHZ << PMC_CTRL_SELCLOCK_SHIFT) |
                (LOWPOWER_CTRL_POFFMODE_OFF << PMC_CTRL_POFFMODE_SHIFT);

    /*
     * Enable wake up interrupt.
     * Rational : we enable each interrupt (NVIC->ISER) that can wake up the CPU here (before the __disable_irq()
     * below): Hence, if an interrupt was pending and not treated before (for any reason), the CPU will jump to that
     *            interrupt handler before trying to enter the low power mode.
     *            VERY IMPORTANT : Also, any interrupt set in NVIC->ISER, even though __disable_irq(), will make the CPU
     *                             go out of the Deep Sleep mode.
     */
    NVIC->ISER[0] = (uint32_t)(wakeupInterrupts & 0xFFFFFFFF);
    NVIC->ISER[1] = (uint32_t)((wakeupInterrupts >> 32) & 0xFFFFFFFF);

    /* Exception for OSTIMER */
    if (wakeupInterrupts & kWAKEUP_OS_EVENT)
    {
        PMC->OSTIMERr |= PMC_OSTIMER_DPDWAKEUPENABLE_MASK;
        wakeupInterrupts &= ~(uint32_t)kWAKEUP_OS_EVENT;
    }

    /* Enable wake-up sources */
    SYSCON->STARTER[0] = (uint32_t)(wakeupInterrupts & 0xFFFFFFFF);
    SYSCON->STARTER[1] = (uint32_t)((wakeupInterrupts >> 32) & 0xFFFFFFFF);

    /* Configure wake-up by I/O */
    PMC->WAKEUPIOCTRL =
        wakeupIoCtrl |
        PMC_WAKEUPIOCTRL_WAKEUPIO_RSTN_MASK; /* include RSTN to generate WAKEIOCAUSE being set in RESETCAUSE reg */

    /* Enable DEEP POWER DOWN reset */
    PMC->RESETCTRL |= PMC_RESETCTRL_DPDWAKEUPRESETENABLE_MASK;

    POWER_PowerCycleCpuAndFlash();

    /* Should never come here (due to reboot) after wakeup */
    return kStatus_Success;
}

/**
 * @brief Enter power off mode
 * @param excludeFromPd Bitmask of peripherals to keep powered
 * @param wakeupIoCtrl Wakeup I/O control configuration
 * @return Status of operation
 */
status_t POWER_EnterPowerOff(uint32_t excludeFromPd, uint32_t wakeupIoCtrl)
{
    /* Validate input. */
    /* Only the following peripherals can be excluded from power off: */
    if (excludeFromPd & ~(uint32_t)kEXCLUDE_FROM_PD_LIMITATION_MASK_POWEROFF)
    {
        return kStatus_InvalidArgument;
    }

    status_t status = SetPowerConfiguration(kLP_MODE_POWEROFF, &excludeFromPd);
    if (status != kStatus_Success)
    {
        return status;
    }

    /* Set excluded peripherals */
    uint32_t pmcSleepcfg0 = ~(excludeFromPd & EXCLUDE_FROM_PD_TO_SLEEPCFG0_MASK);

    PMC->PDSLEEPCFG0 = pmcSleepcfg0;

    SYSCON->NMISRC &= ~SYSCON_NMISRC_NMIENCPU0_MASK; /* Disable NMI of CPU0 */

    PMC->CTRL = (LOWPOWER_CTRL_SELCLOCK_1MHZ << PMC_CTRL_SELCLOCK_SHIFT) |
                (LOWPOWER_CTRL_POFFMODE_ON << PMC_CTRL_POFFMODE_SHIFT);

    /* Configure wake-up by I/O */
    PMC->WAKEUPIOCTRL = wakeupIoCtrl;

    POWER_PowerCycleCpuAndFlash();

    return kStatus_Success; /* Never comes here */
}

/**
 * @brief Get current DCDC supply mode
 * @return Current supply mode
 */
dcdc_mode_t POWER_DCDC_GetSupplyMode(void)
{
    dcdc_mode_t mode;
    uint32_t aoreg1 = PMC->AOREG1;

    if (aoreg1 & AOREG1_DCDC_MODE_XR_SM_SS_MASK)
    {
        mode = kDCDC_MODE_XR_SM_SS;
    }
    else if (aoreg1 & AOREG1_DCDC_MODE_XR_SM_DS_MASK)
    {
        mode = kDCDC_MODE_XR_SM_DS;
    }
    else
    {
        /* Relies on match between dcdc_mode_t and dcdc_hw_mode_t */
        mode = (dcdc_mode_t)((PMC->STATUSPWR & PMC_STATUSPWR_DCDCMODE_MASK) >> PMC_STATUSPWR_DCDCMODE_SHIFT);
    }
    return mode;
}

/**
 * @brief Set DCDC supply mode
 * @param mode Supply mode to set
 * @return Status of operation
 */
status_t POWER_DCDC_SetSupplyMode(dcdc_mode_t mode)
{
    status_t status = kStatus_Success;
    dcdc_hw_mode_t hwDcdcMode =
        (dcdc_hw_mode_t)((PMC->STATUSPWR & PMC_STATUSPWR_DCDCMODE_MASK) >> PMC_STATUSPWR_DCDCMODE_SHIFT);
    chip_version_t version = SYSTEM_GetChipVersion();

