zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/drivers/fsl_power.c
    if (mode == kDCDC_MODE_HV_SM)
    {
        /* Buck (HV), supported on MCXW23xB */
        if (version == kCHIPVERSION_A3 || version == kCHIPVERSION_A4)
        {
            /* Check if reported HW PMC mode matches with inputs*/
            if (hwDcdcMode != kDCDC_HW_MODE_HV_SM)
            {
                return kStatus_Power_SupplyModeModeInvalid;
            }
        }
        else
        {
            return kStatus_Power_SupplyModeModeNotSupported;
        }
    }
    /* Boost (LV), supported on MCXW23xA */
    else if (mode == kDCDC_MODE_LV_SM)
    {
        if (version == kCHIPVERSION_A5)
        {
            if (hwDcdcMode != kDCDC_HW_MODE_LV_SM)
            {
                return kStatus_Power_SupplyModeModeInvalid;
            }
        }
        else
        {
            return kStatus_Power_SupplyModeModeNotSupported;
        }
    }
    /* External regulated single supply (XRSM SM), supported on MCXW23xB */
    else if (mode == kDCDC_MODE_XR_SM_SS)
    {
        if (version == kCHIPVERSION_A3 || version == kCHIPVERSION_A4)
        {
            /* disable DCDC */
            POWER_DCDC_Disable();
            PMC->AOREG1 |= AOREG1_DCDC_MODE_XR_SM_SS_MASK; /* Register reset on POR, BOD, to be set only once */
        }
        else
        {
            return kStatus_Power_SupplyModeModeNotSupported;
        }
    }
    /* External regulated dual supply (XRSM DM), supported on MCXW23xB */
    else if (mode == kDCDC_MODE_XR_SM_DS)
    {
        if (version == kCHIPVERSION_A3 || version == kCHIPVERSION_A4)
        {
            if (version == kCHIPVERSION_A4)
            {
                /* disable DCDC */
                POWER_DCDC_Disable();
            }
            PMC->AOREG1 |= AOREG1_DCDC_MODE_XR_SM_DS_MASK; /* Register reset on POR, BOD, to be set only once */
        }
        else
        {
            return kStatus_Power_SupplyModeModeNotSupported;
        }
    }
    else
    {
        return kStatus_Power_SupplyModeModeNotSupported;
    }
    return status;
}

/**
 * @brief Disable DCDC converter. When the device is using an external supply mode, the DC/DC convertor
 * should be disabled. When supply mode is kDCDC_MODE_LV_SM , the DC/DC can be disabled but the flash subsystem can't be
 * used. All code needs to run from RAM. When supply mode is kDCDC_MODE_HV_SM , the DCDC can't be disabled.
 */
void POWER_DCDC_Disable(void)
{
    POWER_PeripheralPowerOff(kPOWERCFG_DCDC);
}

/**
 * @brief Enable DCDC converter
 */
void POWER_DCDC_Enable(void)
{
    POWER_PeripheralPowerOn(kPOWERCFG_DCDC);
}

/*!
 * @brief Function to configure output level of DC/DC convertor when configured in buck mode.
 * @pre Can only be used supply mode kDCDC_MODE_HV_SM is used.
 * @param outputLvl    The output level of the DC/DC convertor.
 */
void POWER_DCDC_ConfigureBuckOutput(dcdc_buck_output_level_t outputLvl)
{
    PMC->DCDC0 = (PMC->DCDC0 & ~PMC_DCDC0_VOLTAGE_MASK) | outputLvl << PMC_DCDC0_VOLTAGE_SHIFT;
}

/*!
 * @brief Function to configure output level of DC/DC convertor when configured in boost mode.
 * @pre Can only be used supply mode kDCDC_MODE_LV_SM is used.
 * @param outputLvl    The output level of the DC/DC convertor.
 */
void POWER_DCDC_ConfigureBoostOutput(dcdc_boost_output_level_t outputLvl)
{
    PMC->DCDC0 = (PMC->DCDC0 & ~PMC_DCDC0_VOLTAGE_MASK) | outputLvl << PMC_DCDC0_VOLTAGE_SHIFT;
}

/*!
 * @brief Function to retrieve the time it took for the DC/DC to have stable output level. Note that the measurement
 * circuit saturates at 0xFFFF (65535 us). The times it takes for the DC/DC to stabilize the output can be used to fine
 * tune the BLE wake up timer. The BLE stack needs to enable 'correction' of the BLE wakeup timer based on how long it
 * takes for the DC/DC to stabilize.
 * @return value that indicates how long it took for DC/DC convertor to have a stable output in us.
 */
uint16_t POWER_DCDC_GetStartupDuration(void)
{
    return (uint16_t)((PMC->STATUSPWR & PMC_STATUSPWR_DURATION_MASK) >> PMC_STATUSPWR_DURATION_SHIFT);
}

/**
 * @brief Get power library version
 * @return Version number of the power library
 */
uint32_t POWER_GetLibVersion(void)
{
    return FSL_MCXW23_POWER_CONTROL_VERSION;
}

/*!
 * @brief Function to configure the detection level of BOD1.
 * @param level      BOD1 detect level
 * @post             BOD1 is configured to kBOD_NO_ACTION
 * @post             this call must be followed by POWER_ConfigureBOD1() if reset or interrupt is required
 */
void POWER_SetBod1Level(bod_level_t level)
{
    POWER_ConfigureBOD1(kBOD_NO_ACTION);
    /* The BOD mode does not work as expected and the accuracy of the threshold is not good enough.
     * So we always use level detect mode and use the hysteresis to trim the level based on data stored in NMPA. */
    PMC->BOD1 = AdjustedLevelRegisterSetting(
        level, (FLASH_NMPA->BOD & FLASH_NMPA_BOD_BOD1_TRIGLVL_MASK) >> FLASH_NMPA_BOD_BOD1_TRIGLVL_SHIFT);
}

/*!
 * @brief Function to configure the detection level of BOD2.
 * @param level      BOD2 detect level
 * @post             BOD2 is configured to kBOD_NO_ACTION
 * @post             this call must be followed by POWER_ConfigureBOD2() if reset or interrupt is required
 */
void POWER_SetBod2Level(bod_level_t level)
{
    POWER_ConfigureBOD2(kBOD_NO_ACTION);
    /* The BOD mode does not work as expected and the accuracy of the threshold is not good enough.
     * So we always use level detect mode and use the hysteresis to trim the level based on data stored in NMPA. */
    PMC->BOD2 = AdjustedLevelRegisterSetting(
        level, (FLASH_NMPA->BOD & FLASH_NMPA_BOD_BOD2_TRIGLVL_MASK) >> FLASH_NMPA_BOD_BOD2_TRIGLVL_SHIFT);
}

/*!
 * @brief Function to configure the BOD1 action. Note that BOD is disabled automatically when BOD reset is triggered but
 * the settings remain.
 * @param action     the action to take when a BOD is detected
 */
void POWER_ConfigureBOD1(bod_action_t action)
{
    switch (action)
    {
        case kBOD_INTERRUPT:
            DisableBOD1Resets();
            EnableBOD1Interrupts();
            break;
        case kBOD_RESET:
            DisableBOD1Interrupts();
            EnableBOD1Resets();
            break;
        default: /* This includes kBOD_NO_ACTION */
            DisableBOD1Interrupts();
            DisableBOD1Resets();
            break;
    }
}

/*!
 * @brief Function to configure the BOD2 action. Note that BOD is disabled automatically when BOD reset is triggered but
 * the settings remain.
 * @param action     the action to take when a BOD is detected
 */
void POWER_ConfigureBOD2(bod_action_t action)
{
    switch (action)
    {
        case kBOD_INTERRUPT:
            DisableBOD2Resets();
            EnableBOD2Interrupts();
            break;
        case kBOD_RESET:
            DisableBOD2Interrupts();
            EnableBOD2Resets();
            break;
        default: /* This includes kBOD_NO_ACTION */
            DisableBOD2Interrupts();
            DisableBOD2Resets();
            break;
    }
}

/*!
 * @brief Function to clear the BOD1 interrupt. It does not
 *        clear the interrupt in the NVIC.
 */
void POWER_ClearBOD1Interrupt(void)
{
    uint32_t intCtrl = ANACTRL->BOD_DCDC_INT_CTRL;
    intCtrl |= ANACTRL_BOD_DCDC_INT_CTRL_BOD1_INT_CLEAR_MASK;
    ANACTRL->BOD_DCDC_INT_CTRL = intCtrl;
}

/*!
 * @brief Function to clear the BOD2 interrupt. It does not
 *        clear the interrupt in the NVIC.
 */
void POWER_ClearBOD2Interrupt(void)
{
    uint32_t intCtrl = ANACTRL->BOD_DCDC_INT_CTRL;
    intCtrl |= ANACTRL_BOD_DCDC_INT_CTRL_BOD2_INT_CLEAR_MASK;
    ANACTRL->BOD_DCDC_INT_CTRL = intCtrl;
}

/*!
 * @brief Function to retrieve the BOD1 status.
 * @return true as long as BOD1 detects a voltage below the threshold
 */
bool POWER_IsBOD1Active(void)
{
    return ((ANACTRL->BOD_DCDC_INT_STATUS & ANACTRL_BOD_DCDC_INT_STATUS_BOD1_VAL_MASK) == 0);
}

/*!
 * @brief Function to retrieve the BOD2 status.
 * @return true as long as BOD2 detects a voltage below the threshold
 */
bool POWER_IsBOD2Active(void)
{
    return ((ANACTRL->BOD_DCDC_INT_STATUS & ANACTRL_BOD_DCDC_INT_STATUS_BOD2_VAL_MASK) == 0);
}

/*!
 * @brief Function to retrieve the reset cause.
 * @pre	   only valid when coming from DEEP POWER DOWN
 * @return reset cause register content when it was saved by bootloader - only significant bits
 */
reset_cause_t POWER_GetResetCause(void)
{
    return (reset_cause_t)((PMC->AOREG1 >> 4) & 0xfff);
}

/**
 * @brief Configure 32K XTAL capacitors
 * @param capIn Input capacitor setting
 * @param capOut Output capacitor setting
 */
void POWER_XTAL32K_ConfigureCaps(uint8_t capIn, uint8_t capOut)
{
    uint32_t val = PMC->XTAL32K;
    val &= ~(PMC_XTAL32K_CAP_OSCIN_MASK | PMC_XTAL32K_CAP_OSCOUT_MASK);
    val |= ((uint32_t)capIn << PMC_XTAL32K_CAP_OSCIN_SHIFT) | ((uint32_t)capOut << PMC_XTAL32K_CAP_OSCOUT_SHIFT);
    PMC->XTAL32K = val;
}

/**
 * @brief Configure 32K XTAL reference output current
 * @param gm Transconductance setting
 */
void POWER_XTAL32K_ConfigureReferenceOutputCurrent(uint8_t gm)
{
    uint32_t val = PMC->XTAL32K;
    val &= ~(PMC_XTAL32K_GM_MASK);
    val |= ((uint32_t)gm << PMC_XTAL32K_GM_SHIFT);
    PMC->XTAL32K = val;
}

/**
 * @brief Configure 32K XTAL oscillator amplitude
 * @param ampl Amplitude setting
 */
void POWER_XTAL32K_ConfigureOscillatorAmplitude(uint8_t ampl)
{
    uint32_t val = PMC->XTAL32K;
    val &= ~(PMC_XTAL32K_AMPL_MASK);
    val |= ((uint32_t)ampl << PMC_XTAL32K_AMPL_SHIFT);
    PMC->XTAL32K = val;
}

/**
 * @brief Enable/disable 32K XTAL bypass mode
 * @param enable true to enable bypass, false to disable
 */
void POWER_XTAL32K_EnableBypass(bool enable)
{
    if (enable)
    {
        POWER_PeripheralPowerOn(kPOWERCFG_XTAL32K);
        PMC->XTAL32K |= 1UL << PMC_XTAL32K_XTM_SHIFT;
        POWER_XTAL32K_ConfigureCaps(0, 0);
    }
    else
    {
        PMC->XTAL32K &= ~(1UL << PMC_XTAL32K_XTM_SHIFT);
    }
}

/**
 * @brief Enable/disable BLE clock gating for 32M XTAL
 * @param enable true to enable, false to disable
 */
void POWER_XTAL32M_BLE_GateEnable(bool enable)
{
    if (enable)
    {
        // ungate BLE clock - gate-on the BLE-PHY cko16 to BLE-LL aclk
        PMC->XTALBLE |= PMC_XTALBLE_CKO_UNGATE_OVERRULE_MASK;
    }
    else
    {
        PMC->XTALBLE &= ~PMC_XTALBLE_CKO_UNGATE_OVERRULE_MASK;
    }
}

/**
 * @brief Set 32M XTAL startup time
 * @param startupTime Startup time setting (1-15)
 * @return Status of operation
 */
status_t POWER_XTAL32M_SetStartupTime(uint8_t startupTime)
{
    status_t status = kStatus_InvalidArgument;
    if (startupTime > 0 && startupTime <= 15)
    {
        PMC->TIMEOUT = (PMC->TIMEOUT & ~PMC_TIMEOUT_BLE_RESTART_OSCEN_TIME_OUT_MASK) |
                       (startupTime << PMC_TIMEOUT_BLE_RESTART_OSCEN_TIME_OUT_SHIFT);
        status = kStatus_Success;
    }
    return status;
}

/**
 * Measure the voltage on Vbat_hv using BOD1.
 *
 * Normal operation of BOD1 is suspended during the conversion.
 * Voltage must remain stable during conversion in order to get accurate results
 * Note that WDT_BOD_IRQn is disabled during the measurement but is restored afterwards.
 *
 * @param voltage pointer to variable that'll hold the measured voltage in millivolts
 * @return kStatus_Success in case of success.
 */
status_t POWER_MeasureVoltageWithBod1(uint32_t *voltage)
{
    return MeasureVoltage(0, voltage);
}

/**
 * Measure the voltage on Vbat_hv using BOD2.
 *
 * Normal operation of BOD2 is suspended during the conversion.
 * Voltage must remain stable during conversion in order to get accurate results
 * Note that WDT_BOD_IRQn is disabled during the measurement but is restored afterwards.
 *
 * @param voltage pointer to variable that'll hold the measured voltage in millivolts
 * @return kStatus_Success in case of success.
 */
status_t POWER_MeasureVoltageWithBod2(uint32_t *voltage)
{
    return MeasureVoltage(1, voltage);
}
